tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18857_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F18857_H_
#define _PIC16F18857_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define BSR5                          21
#define WREG                          22
#define WREG0                         23
#define PCLATH                        24
#define INTCON                        25
#define INTEDG                        26
#define PEIE                          27
#define GIE                           28
#define PORTA                         29
#define RA0                           30
#define RA1                           31
#define RA2                           32
#define RA3                           33
#define RA4                           34
#define RA5                           35
#define RA6                           36
#define RA7                           37
#define PORTB                         38
#define RB0                           39
#define RB1                           40
#define RB2                           41
#define RB3                           42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PORTE                         56
#define RE3                           57
#define TRISA                         58
#define TRISA0                        59
#define TRISA1                        60
#define TRISA2                        61
#define TRISA3                        62
#define TRISA4                        63
#define TRISA5                        64
#define TRISA6                        65
#define TRISA7                        66
#define TRISB                         67
#define TRISB0                        68
#define TRISB1                        69
#define TRISB2                        70
#define TRISB3                        71
#define TRISB4                        72
#define TRISB5                        73
#define TRISB6                        74
#define TRISB7                        75
#define TRISC                         76
#define TRISC0                        77
#define TRISC1                        78
#define TRISC2                        79
#define TRISC3                        80
#define TRISC4                        81
#define TRISC5                        82
#define TRISC6                        83
#define TRISC7                        84
#define LATA                          85
#define LATA0                         86
#define LATA1                         87
#define LATA2                         88
#define LATA3                         89
#define LATA4                         90
#define LATA5                         91
#define LATA6                         92
#define LATA7                         93
#define LATB                          94
#define LATB0                         95
#define LATB1                         96
#define LATB2                         97
#define LATB3                         98
#define LATB4                         99
#define LATB5                         100
#define LATB6                         101
#define LATB7                         102
#define LATC                          103
#define LATC0                         104
#define LATC1                         105
#define LATC2                         106
#define LATC3                         107
#define LATC4                         108
#define LATC5                         109
#define LATC6                         110
#define LATC7                         111
#define TMR0L0                        112
#define TMR0L                         113
#define TMR0L1                        114
#define TMR0L2                        115
#define TMR0L3                        116
#define TMR0L4                        117
#define TMR0L5                        118
#define TMR0L6                        119
#define TMR0L7                        120
#define TMR0H0                        121
#define T0PR                          122
#define TMR0H                         123
#define T0PR0                         124
#define TMR0H1                        125
#define T0PR1                         126
#define TMR0H2                        127
#define T0PR2                         128
#define TMR0H3                        129
#define T0PR3                         130
#define TMR0H4                        131
#define T0PR4                         132
#define TMR0H5                        133
#define T0PR5                         134
#define TMR0H6                        135
#define T0PR6                         136
#define TMR0H7                        137
#define T0PR7                         138
#define T0CON0                        139
#define T0OUTPS                       140
#define T0OUTPS0                      141
#define T0OUTPS1                      142
#define T0OUTPS2                      143
#define T0OUTPS3                      144
#define T016BIT                       145
#define T0OUT                         146
#define T0EN                          147
#define T0CON1                        148
#define T0PS                          149
#define T0CKPS                        150
#define T0CKPS0                       151
#define T0PS0                         152
#define T0CKPS1                       153
#define T0PS1                         154
#define T0CKPS2                       155
#define T0PS2                         156
#define T0CKPS3                       157
#define T0PS3                         158
#define T0ASYNC                       159
#define T0CS                          160
#define T0CS0                         161
#define T0CS1                         162
#define T0CS2                         163
#define ADRESL                        164
#define ADPREVL                       165
#define ADPREV0                       166
#define ADPREV1                       167
#define ADPREV2                       168
#define ADPREV3                       169
#define ADPREV4                       170
#define ADPREV5                       171
#define ADPREV6                       172
#define ADPREV7                       173
#define ADPREVH                       174
#define ADPREV8                       175
#define ADPREV9                       176
#define ADPREV10                      177
#define ADPREV11                      178
#define ADPREV12                      179
#define ADPREV13                      180
#define ADPREV14                      181
#define ADPREV15                      182
#define ADACC0                        183
#define ADACCL                        184
#define ADACC1                        185
#define ADACC2                        186
#define ADACC3                        187
#define ADACC4                        188
#define ADACC5                        189
#define ADACC6                        190
#define ADACC7                        191
#define ADACC8                        192
#define ADACCH                        193
#define ADACC9                        194
#define ADACC10                       195
#define ADACC11                       196
#define ADACC12                       197
#define ADACC13                       198
#define ADACC14                       199
#define ADACC15                       200
#define ADCON0                        201
#define nDONE                         202
#define DONE                          203
#define GO                            204
#define GO_nDONE                      205
#define ADGO                          206
#define ADFM                          207
#define ADFM0                         208
#define ADFM1                         209
#define ADCS                          210
#define ADCONT                        211
#define ADON                          212
#define ADCON1                        213
#define ADDSEN                        214
#define ADGPOL                        215
#define ADIPEN                        216
#define ADPPOL                        217
#define ADCON2                        218
#define ADMD                          219
#define ADMD0                         220
#define ADMD1                         221
#define ADMD2                         222
#define ADACLR                        223
#define ADCRS                         224
#define ADCRS0                        225
#define ADCRS1                        226
#define ADCRS2                        227
#define ADPSIS                        228
#define ADCON3                        229
#define ADTMD                         230
#define ADTMD0                        231
#define ADTMD1                        232
#define ADTMD2                        233
#define ADSOI                         234
#define ADCALC                        235
#define ADCALC0                       236
#define ADCALC1                       237
#define ADCALC2                       238
#define ADSTAT                        239
#define ADSTAT0                       240
#define ADSTAT1                       241
#define ADSTAT2                       242
#define ADMACT                        243
#define ADMATH                        244
#define ADLTHR                        245
#define ADUTHR                        246
#define ADAOV                         247
#define ADCLK                         248
#define ADCCS0                        249
#define ADCCS                         250
#define ADCCS1                        251
#define ADCCS2                        252
#define ADCCS3                        253
#define ADCCS4                        254
#define ADCCS5                        255
#define ADACT0                        256
#define ADACT                         257
#define ADACT1                        258
#define ADACT2                        259
#define ADACT3                        260
#define ADACT4                        261
#define ADREF                         262
#define ADPREF                        263
#define ADPREF0                       264
#define ADPREF1                       265
#define ADNREF                        266
#define ADCAP                         267
#define ADCAP0                        268
#define ADCAP1                        269
#define ADCAP2                        270
#define ADCAP3                        271
#define ADCAP4                        272
#define ADPRE0                        273
#define ADPRE                         274
#define ADPRE1                        275
#define ADPRE2                        276
#define ADPRE3                        277
#define ADPRE4                        278
#define ADPRE5                        279
#define ADPRE6                        280
#define ADPRE7                        281
#define ADACQ                         282
#define ADACQ0                        283
#define ADACQ1                        284
#define ADACQ2                        285
#define ADACQ3                        286
#define ADACQ4                        287
#define ADACQ5                        288
#define ADACQ6                        289
#define ADACQ7                        290
#define ADPCH                         291
#define ADPCH0                        292
#define ADPCH1                        293
#define ADPCH2                        294
#define ADPCH3                        295
#define ADPCH4                        296
#define ADPCH5                        297
#define ADCNT0                        298
#define ADCNT                         299
#define ADCNT1                        300
#define ADCNT2                        301
#define ADCNT3                        302
#define ADCNT4                        303
#define ADCNT5                        304
#define ADCNT6                        305
#define ADCNT7                        306
#define ADRPT0                        307
#define ADRPT                         308
#define ADRPT1                        309
#define ADRPT2                        310
#define ADRPT3                        311
#define ADRPT4                        312
#define ADRPT5                        313
#define ADRPT6                        314
#define ADRPT7                        315
#define ADLTH0                        316
#define ADLTHL                        317
#define ADLTH1                        318
#define ADLTH2                        319
#define ADLTH3                        320
#define ADLTH4                        321
#define ADLTH5                        322
#define ADLTH6                        323
#define ADLTH7                        324
#define ADLTH8                        325
#define ADLTHH                        326
#define ADLTH9                        327
#define ADLTH10                       328
#define ADLTH11                       329
#define ADLTH12                       330
#define ADLTH13                       331
#define ADLTH14                       332
#define ADLTH15                       333
#define ADUTH0                        334
#define ADUTHL                        335
#define ADUTH1                        336
#define ADUTH2                        337
#define ADUTH3                        338
#define ADUTH4                        339
#define ADUTH5                        340
#define ADUTH6                        341
#define ADUTH7                        342
#define ADUTH8                        343
#define ADUTHH                        344
#define ADUTH9                        345
#define ADUTH10                       346
#define ADUTH11                       347
#define ADUTH12                       348
#define ADUTH13                       349
#define ADUTH14                       350
#define ADUTH15                       351
#define ADSTPT0                       352
#define ADSTPTL                       353
#define ADSTPT1                       354
#define ADSTPT2                       355
#define ADSTPT3                       356
#define ADSTPT4                       357
#define ADSTPT5                       358
#define ADSTPT6                       359
#define ADSTPT7                       360
#define ADSTPT8                       361
#define ADSTPTH                       362
#define ADSTPT9                       363
#define ADSTPT10                      364
#define ADSTPT11                      365
#define ADSTPT12                      366
#define ADSTPT13                      367
#define ADSTPT14                      368
#define ADSTPT15                      369
#define ADFLTR0                       370
#define ADFLTRL                       371
#define ADFLTR1                       372
#define ADFLTR2                       373
#define ADFLTR3                       374
#define ADFLTR4                       375
#define ADFLTR5                       376
#define ADFLTR6                       377
#define ADFLTR7                       378
#define ADFLTR8                       379
#define ADFLTRH                       380
#define ADFLTR9                       381
#define ADFLTR10                      382
#define ADFLTR11                      383
#define ADFLTR12                      384
#define ADFLTR13                      385
#define ADFLTR14                      386
#define ADFLTR15                      387
#define ADERR0                        388
#define ADERRL                        389
#define ADERR1                        390
#define ADERR2                        391
#define ADERR3                        392
#define ADERR4                        393
#define ADERR5                        394
#define ADERR6                        395
#define ADERR7                        396
#define ADERR8                        397
#define ADERRH                        398
#define ADERR9                        399
#define ADERR10                       400
#define ADERR11                       401
#define ADERR12                       402
#define ADERR13                       403
#define ADERR14                       404
#define ADERR15                       405
#define RC1REG                        406
#define TX1REG                        407
#define SP1BRGL                       408
#define SP1BRGH                       409
#define RC1STA                        410
#define RX9D                          411
#define OERR                          412
#define FERR                          413
#define ADDEN                         414
#define CREN                          415
#define SREN                          416
#define RX9                           417
#define SPEN                          418
#define TX1STA                        419
#define TX9D                          420
#define TRMT                          421
#define BRGH                          422
#define SENDB                         423
#define TX1STA_SYNC                   424
#define TXEN                          425
#define TX9                           426
#define CSRC                          427
#define BAUD1CON                      428
#define ABDEN                         429
#define WUE                           430
#define BRG16                         431
#define SCKP                          432
#define RCIDL                         433
#define ABDOVF                        434
#define SSP1BUF                       435
#define SSP1BUF_SSPBUF                436
#define SSP1ADD                       437
#define SSP1ADD_SSPADD                438
#define SSP1MSK                       439
#define SSP1MSK_MSK0                  440
#define SSP1MSK_SSPMSK                441
#define SSP1MSK_MSK1                  442
#define SSP1MSK_MSK2                  443
#define SSP1MSK_MSK3                  444
#define SSP1MSK_MSK4                  445
#define SSP1MSK_MSK5                  446
#define SSP1MSK_MSK6                  447
#define SSP1MSK_MSK7                  448
#define SSP1STAT                      449
#define SSP1STAT_BF                   450
#define SSP1STAT_UA                   451
#define SSP1STAT_nWRITE               452
#define SSP1STAT_nW                   453
#define SSP1STAT_READ_WRITE           454
#define SSP1STAT_I2C_READ             455
#define SSP1STAT_R_W                  456
#define SSP1STAT_R_nW                 457
#define SSP1STAT_S                    458
#define SSP1STAT_I2C_START            459
#define SSP1STAT_P                    460
#define SSP1STAT_I2C_STOP             461
#define SSP1STAT_D_A                  462
#define SSP1STAT_D_nA                 463
#define SSP1STAT_DATA_ADDRESS         464
#define SSP1STAT_nA                   465
#define SSP1STAT_nADDRESS             466
#define SSP1STAT_I2C_DAT              467
#define SSP1STAT_CKE                  468
#define SSP1STAT_SMP                  469
#define SSP1CON1                      470
#define SSP1CON1_SSPM                 471
#define SSP1CON1_SSPM0                472
#define SSP1CON1_SSPM1                473
#define SSP1CON1_SSPM2                474
#define SSP1CON1_SSPM3                475
#define SSP1CON1_CKP                  476
#define SSP1CON1_SSPEN                477
#define SSP1CON1_SSPOV                478
#define SSP1CON1_WCOL                 479
#define SSP1CON2                      480
#define SSP1CON2_SEN                  481
#define SSP1CON2_RSEN                 482
#define SSP1CON2_ADMSK1               483
#define SSP1CON2_ADMSK                484
#define SSP1CON2_ADMSK2               485
#define SSP1CON2_PEN                  486
#define SSP1CON2_RCEN                 487
#define SSP1CON2_ADMSK3               488
#define SSP1CON2_ACKEN                489
#define SSP1CON2_ADMSK4               490
#define SSP1CON2_ACKDT                491
#define SSP1CON2_ADMSK5               492
#define SSP1CON2_ACKSTAT              493
#define SSP1CON2_GCEN                 494
#define SSP1CON3                      495
#define SSP1CON3_DHEN                 496
#define SSP1CON3_AHEN                 497
#define SSP1CON3_SBCDE                498
#define SSP1CON3_SDAHT                499
#define SSP1CON3_BOEN                 500
#define SSP1CON3_SCIE                 501
#define SSP1CON3_PCIE                 502
#define SSP1CON3_ACKTIM               503
#define SSP2BUF                       504
#define SSP2BUF_SSPBUF                505
#define SSP2ADD                       506
#define SSP2ADD_SSPADD                507
#define SSP2MSK                       508
#define SSP2MSK_SSPMSK                509
#define SSP2MSK_MSK0                  510
#define SSP2MSK_MSK1                  511
#define SSP2MSK_MSK2                  512
#define SSP2MSK_MSK3                  513
#define SSP2MSK_MSK4                  514
#define SSP2MSK_MSK5                  515
#define SSP2MSK_MSK6                  516
#define SSP2MSK_MSK7                  517
#define SSP2STAT                      518
#define SSP2STAT_BF                   519
#define SSP2STAT_UA                   520
#define SSP2STAT_R_W                  521
