tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18857_tdd.h
#define CCP4CON_MODE1                 1091
#define CCP4MODE1                     1092
#define CCP4CON_MODE2                 1093
#define CCP4MODE2                     1094
#define CCP4CON_MODE3                 1095
#define CCP4MODE3                     1096
#define CCP4FMT                       1097
#define CCP4CON_FMT                   1098
#define CCP4CON_OUT                   1099
#define CCP4OUT                       1100
#define CCP4OE                        1101
#define CCP4CON_OE                    1102
#define CCP4EN                        1103
#define CCP4CON_EN                    1104
#define CCP4CAP                       1105
#define CCP4CAP_CTS0                  1106
#define CCP4CTS                       1107
#define CCP4CAP_CTS                   1108
#define CCP4CTS0                      1109
#define CCP4CAP_CTS1                  1110
#define CCP4CTS1                      1111
#define CCP4CAP_CTS2                  1112
#define CCP4CTS2                      1113
#define CCPR5L                        1114
#define CCPR5L_RL                     1115
#define CCPR5H                        1116
#define CCPR5H_RH                     1117
#define CCP5CON                       1118
#define CCP5CON_MODE                  1119
#define CCP5MODE                      1120
#define CCP5MODE0                     1121
#define CCP5CON_MODE0                 1122
#define CCP5MODE1                     1123
#define CCP5CON_MODE1                 1124
#define CCP5MODE2                     1125
#define CCP5CON_MODE2                 1126
#define CCP5MODE3                     1127
#define CCP5CON_MODE3                 1128
#define CCP5FMT                       1129
#define CCP5CON_FMT                   1130
#define CCP5CON_OUT                   1131
#define CCP5OUT                       1132
#define CCP5CON_OE                    1133
#define CCP5OE                        1134
#define CCP5EN                        1135
#define CCP5CON_EN                    1136
#define CCP5CAP                       1137
#define CCP5CAP_CTS                   1138
#define CCP5CTS0                      1139
#define CCP5CAP_CTS0                  1140
#define CCP5CTS                       1141
#define CCP5CTS1                      1142
#define CCP5CAP_CTS1                  1143
#define CCP5CTS2                      1144
#define CCP5CAP_CTS2                  1145
#define PWM6DCL                       1146
#define PWM6DCL_DC                    1147
#define PWM6DCL_DC0                   1148
#define PWM6DCL_PWMPW0                1149
#define PWM6DC0                       1150
#define PWM6DCL_DC1                   1151
#define PWM6DCL_PWMPW1                1152
#define PWM6DC1                       1153
#define PWM6DCH                       1154
#define PWM6DCH_DC2                   1155
#define PWM6DCH_DC                    1156
#define PWM6DCH_PWMPW2                1157
#define PWM6DC2                       1158
#define PWM6DCH_DC3                   1159
#define PWM6DCH_PWMPW3                1160
#define PWM6DC3                       1161
#define PWM6DCH_DC4                   1162
#define PWM6DCH_PWMPW4                1163
#define PWM6DC4                       1164
#define PWM6DCH_DC5                   1165
#define PWM6DCH_PWMPW5                1166
#define PWM6DC5                       1167
#define PWM6DCH_DC6                   1168
#define PWM6DCH_PWMPW6                1169
#define PWM6DC6                       1170
#define PWM6DCH_DC7                   1171
#define PWM6DCH_PWMPW7                1172
#define PWM6DC7                       1173
#define PWM6DCH_DC8                   1174
#define PWM6DC8                       1175
#define PWM6DCH_PWMPW8                1176
#define PWM6DCH_DC9                   1177
#define PWM6DC9                       1178
#define PWM6DCH_PWMPW9                1179
#define PWM6CON                       1180
#define PWM6POL                       1181
#define PWM6CON_POL                   1182
#define PWM6OUT                       1183
#define PWM6CON_OUT                   1184
#define PWM6CON_EN                    1185
#define PWM6EN                        1186
#define PWM7DCL                       1187
#define PWM7DCL_PWMPW0                1188
#define PWM7DC0                       1189
#define PWM7DCL_DC                    1190
#define PWM7DCL_DC0                   1191
#define PWM7DCL_PWMPW1                1192
#define PWM7DC1                       1193
#define PWM7DCL_DC1                   1194
#define PWM7DCH                       1195
#define PWM7DCH_DC2                   1196
#define PWM7DCH_DC                    1197
#define PWM7DC2                       1198
#define PWM7DCH_PWMPW2                1199
#define PWM7DCH_PWMPW3                1200
#define PWM7DCH_DC3                   1201
#define PWM7DC3                       1202
#define PWM7DCH_PWMPW4                1203
#define PWM7DCH_DC4                   1204
#define PWM7DC4                       1205
#define PWM7DCH_PWMPW5                1206
#define PWM7DCH_DC5                   1207
#define PWM7DC5                       1208
#define PWM7DCH_DC6                   1209
#define PWM7DC6                       1210
#define PWM7DCH_PWMPW6                1211
#define PWM7DCH_DC7                   1212
#define PWM7DC7                       1213
#define PWM7DCH_PWMPW7                1214
#define PWM7DCH_DC8                   1215
#define PWM7DCH_PWMPW8                1216
#define PWM7DC8                       1217
#define PWM7DCH_DC9                   1218
#define PWM7DCH_PWMPW9                1219
#define PWM7DC9                       1220
#define PWM7CON                       1221
#define PWM7POL                       1222
#define PWM7CON_POL                   1223
#define PWM7CON_OUT                   1224
#define PWM7OUT                       1225
#define PWM7EN                        1226
#define PWM7CON_EN                    1227
#define SCANLADRL                     1228
#define LADR0                         1229
#define LADRL                         1230
#define SCANLADR0                     1231
#define SCANLADR1                     1232
#define LADR1                         1233
#define LADR2                         1234
#define SCANLADR2                     1235
#define LADR3                         1236
#define SCANLADR3                     1237
#define LADR4                         1238
#define SCANLADR4                     1239
#define LADR5                         1240
#define SCANLADR5                     1241
#define LADR6                         1242
#define SCANLADR6                     1243
#define LADR7                         1244
#define SCANLADR7                     1245
#define LADR8                         1246
#define SCANLADRH                     1247
#define LADRH                         1248
#define SCANLADR8                     1249
#define LADR9                         1250
#define SCANLADR9                     1251
#define LADR10                        1252
#define SCANLADR10                    1253
#define LADR11                        1254
#define SCANLADR11                    1255
#define LADR12                        1256
#define SCANLADR12                    1257
#define LADR13                        1258
#define SCANLADR13                    1259
#define LADR14                        1260
#define SCANLADR14                    1261
#define SCANLADR15                    1262
#define LADR15                        1263
#define SCANHADR0                     1264
#define HADR0                         1265
#define HADRL                         1266
#define SCANHADRL                     1267
#define SCANHADR1                     1268
#define HADR1                         1269
#define SCANHADR2                     1270
#define HADR2                         1271
#define SCANHADR3                     1272
#define HADR3                         1273
#define SCANHADR4                     1274
#define HADR4                         1275
#define SCANHADR5                     1276
#define HADR5                         1277
#define SCANHADR6                     1278
#define HADR6                         1279
#define SCANHADR7                     1280
#define HADR7                         1281
#define HADR8                         1282
#define SCANHADR8                     1283
#define HADRH                         1284
#define SCANHADRH                     1285
#define HADR9                         1286
#define SCANHADR9                     1287
#define SCANHADR10                    1288
#define HADR10                        1289
#define HADR11                        1290
#define SCANHADR11                    1291
#define HADR12                        1292
#define SCANHADR12                    1293
#define HADR13                        1294
#define SCANHADR13                    1295
#define HADR14                        1296
#define SCANHADR14                    1297
#define HADR15                        1298
#define SCANHADR15                    1299
#define SCANCON0                      1300
#define SCANMODE                      1301
#define SCANMODE0                     1302
#define SCANCON0_MODE0                1303
#define SCANCON0_MODE                 1304
#define SCANCON0_MODE1                1305
#define SCANMODE1                     1306
#define INTM                          1307
#define SCANINTM                      1308
#define DABORT                        1309
#define INVALID                       1310
#define SCANINVALID                   1311
#define SCANCON0_BUSY                 1312
#define SCANBUSY                      1313
#define SCANGO                        1314
#define SCANEN                        1315
#define SCANCON0_EN                   1316
#define SCANTRIG                      1317
#define TSEL0                         1318
#define TSEL                          1319
#define SCANTSEL0                     1320
#define SCANTSEL                      1321
#define TSEL1                         1322
#define SCANTSEL1                     1323
#define TSEL2                         1324
#define SCANTSEL2                     1325
#define TSEL3                         1326
#define SCANTSEL3                     1327
#define CRCDATL                       1328
#define DATA0                         1329
#define DATA1                         1330
#define DATA2                         1331
#define DATA3                         1332
#define DATA4                         1333
#define DATA5                         1334
#define DATA6                         1335
#define DATA7                         1336
#define CRCDATH                       1337
#define DATA8                         1338
#define DATA9                         1339
#define DATA10                        1340
#define DATA11                        1341
#define DATA12                        1342
#define DATA13                        1343
#define DATA14                        1344
#define DATA15                        1345
#define CRCACCL                       1346
#define ACC0                          1347
#define ACC1                          1348
#define ACC2                          1349
#define ACC3                          1350
#define ACC4                          1351
#define ACC5                          1352
#define ACC6                          1353
#define ACC7                          1354
#define CRCACCH                       1355
#define ACC8                          1356
#define ACC9                          1357
#define ACC10                         1358
#define ACC11                         1359
#define ACC12                         1360
#define ACC13                         1361
#define ACC14                         1362
#define ACC15                         1363
#define CRCSHIFTL                     1364
#define SHFT0                         1365
#define SHFT1                         1366
#define SHFT2                         1367
#define SHFT3                         1368
#define SHFT4                         1369
#define SHFT5                         1370
#define SHFT6                         1371
#define SHFT7                         1372
#define CRCSHIFTH                     1373
#define SHFT8                         1374
#define SHFT9                         1375
#define SHFT10                        1376
#define SHFT11                        1377
#define SHFT12                        1378
#define SHFT13                        1379
#define SHFT14                        1380
#define SHFT15                        1381
#define CRCXORL                       1382
#define X1                            1383
#define X2                            1384
#define X3                            1385
#define X4                            1386
#define X5                            1387
#define X6                            1388
#define X7                            1389
#define CRCXORH                       1390
#define X8                            1391
#define X9                            1392
#define X10                           1393
#define X11                           1394
#define X12                           1395
#define X13                           1396
#define X14                           1397
#define X15                           1398
#define CRCCON0                       1399
#define FULL                          1400
#define SHIFTM                        1401
#define ACCM                          1402
#define CRCCON0_BUSY                  1403
#define CRCGO                         1404
#define CRCCON0_EN                    1405
#define CRCEN                         1406
#define CRCCON1                       1407
#define PLEN0                         1408
#define PLEN                          1409
#define PLEN1                         1410
#define PLEN2                         1411
#define PLEN3                         1412
#define DLEN                          1413
#define DLEN0                         1414
#define DLEN1                         1415
#define DLEN2                         1416
#define DLEN3                         1417
#define SMT1TMRL                      1418
#define SMT1TMR0                      1419
#define SMT1TMRL_SMT1TMR              1420
#define SMT1TMR1                      1421
#define SMT1TMR2                      1422
#define SMT1TMR3                      1423
#define SMT1TMR4                      1424
#define SMT1TMR5                      1425
#define SMT1TMR6                      1426
#define SMT1TMR7                      1427
#define SMT1TMRH                      1428
#define SMT1TMR8                      1429
#define SMT1TMRH_SMT1TMR              1430
#define SMT1TMR9                      1431
#define SMT1TMR10                     1432
#define SMT1TMR11                     1433
#define SMT1TMR12                     1434
#define SMT1TMR13                     1435
#define SMT1TMR14                     1436
#define SMT1TMR15                     1437
#define SMT1TMRU                      1438
#define SMT1TMR16                     1439
#define SMT1TMRU_SMT1TMR              1440
#define SMT1TMR17                     1441
#define SMT1TMR18                     1442
#define SMT1TMR19                     1443
#define SMT1TMR20                     1444
#define SMT1TMR21                     1445
#define SMT1TMR22                     1446
#define SMT1TMR23                     1447
#define SMT1CPRL                      1448
#define SMT1CPRL_CPR0                 1449
#define SMT1CPRL_SMT1CPR              1450
#define SMT1CPRL_CPR                  1451
#define SMT1CPRL_CPR1                 1452
#define SMT1CPRL_CPR2                 1453
#define SMT1CPRL_CPR3                 1454
#define SMT1CPRL_CPR4                 1455
#define SMT1CPRL_CPR5                 1456
#define SMT1CPRL_CPR6                 1457
#define SMT1CPRL_CPR7                 1458
#define SMT1CPRH                      1459
#define SMT1CPRH_CPR                  1460
#define SMT1CPRH_SMT1CPR              1461
#define SMT1CPR8                      1462
#define SMT1CPRH_CPR8                 1463
#define SMT1CPRH_CPR9                 1464
#define SMT1CPR9                      1465
#define SMT1CPRH_CPR10                1466
#define SMT1CPR10                     1467
#define SMT1CPRH_CPR11                1468
#define SMT1CPR11                     1469
#define SMT1CPR12                     1470
#define SMT1CPRH_CPR12                1471
#define SMT1CPRH_CPR13                1472
#define SMT1CPR13                     1473
#define SMT1CPRH_CPR14                1474
#define SMT1CPR14                     1475
#define SMT1CPRH_CPR15                1476
#define SMT1CPR15                     1477
#define SMT1CPRU                      1478
#define SMT1CPRU_CPR16                1479
#define SMT1CPRU_SMT1CPR              1480
#define SMT1CPR16                     1481
#define SMT1CPRU_CPR                  1482
#define SMT1CPRU_CPR17                1483
#define SMT1CPR17                     1484
#define SMT1CPRU_CPR18                1485
#define SMT1CPR18                     1486
#define SMT1CPRU_CPR19                1487
#define SMT1CPR19                     1488
#define SMT1CPR20                     1489
#define SMT1CPRU_CPR20                1490
#define SMT1CPR21                     1491
#define SMT1CPRU_CPR21                1492
#define SMT1CPR22                     1493
#define SMT1CPRU_CPR22                1494
#define SMT1CPR23                     1495
#define SMT1CPRU_CPR23                1496
#define SMT1CPWL                      1497
#define SMT1CPW0                      1498
#define SMT1CPWL_CPW0                 1499
#define SMT1CPWL_CPW                  1500
#define SMT1CPWL_SMT1CPW              1501
#define SMT1CPW1                      1502
#define SMT1CPWL_CPW1                 1503
#define SMT1CPW2                      1504
#define SMT1CPWL_CPW2                 1505
#define SMT1CPW3                      1506
#define SMT1CPWL_CPW3                 1507
#define SMT1CPW4                      1508
#define SMT1CPWL_CPW4                 1509
#define SMT1CPW5                      1510
#define SMT1CPWL_CPW5                 1511
#define SMT1CPW6                      1512
#define SMT1CPWL_CPW6                 1513
#define SMT1CPW7                      1514
#define SMT1CPWL_CPW7                 1515
#define SMT1CPWH                      1516
#define SMT1CPW8                      1517
#define SMT1CPWH_CPW8                 1518
#define SMT1CPWH_SMT1CPW              1519
#define SMT1CPWH_CPW                  1520
#define SMT1CPW9                      1521
#define SMT1CPWH_CPW9                 1522
#define SMT1CPWH_CPW10                1523
#define SMT1CPW10                     1524
#define SMT1CPWH_CPW11                1525
#define SMT1CPW11                     1526
#define SMT1CPWH_CPW12                1527
#define SMT1CPW12                     1528
#define SMT1CPWH_CPW13                1529
#define SMT1CPW13                     1530
#define SMT1CPWH_CPW14                1531
#define SMT1CPW14                     1532
#define SMT1CPWH_CPW15                1533
#define SMT1CPW15                     1534
#define SMT1CPWU                      1535
#define SMT1CPWU_CPW                  1536
#define SMT1CPWU_SMT1CPW              1537
#define SMT1CPW16                     1538
#define SMT1CPWU_CPW16                1539
#define SMT1CPW17                     1540
#define SMT1CPWU_CPW17                1541
#define SMT1CPW18                     1542
#define SMT1CPWU_CPW18                1543
#define SMT1CPW19                     1544
#define SMT1CPWU_CPW19                1545
#define SMT1CPWU_CPW20                1546
#define SMT1CPW20                     1547
#define SMT1CPWU_CPW21                1548
#define SMT1CPW21                     1549
#define SMT1CPWU_CPW22                1550
#define SMT1CPW22                     1551
#define SMT1CPWU_CPW23                1552
#define SMT1CPW23                     1553
#define SMT1PRL                       1554
#define SMT1PR0                       1555
#define SMT1PRL_SMT1PR                1556
#define SMT1PR1                       1557
#define SMT1PR2                       1558
#define SMT1PR3                       1559
#define SMT1PR4                       1560
#define SMT1PR5                       1561
#define SMT1PR6                       1562
#define SMT1PR7                       1563
#define SMT1PRH                       1564
#define SMT1PR8                       1565
#define SMT1PRH_SMT1PR                1566
#define SMT1PR9                       1567
#define SMT1PR10                      1568
#define SMT1PR11                      1569
#define SMT1PR12                      1570
#define SMT1PR13                      1571
#define SMT1PR14                      1572
#define SMT1PR15                      1573
#define SMT1PRU                       1574
#define SMT1PR16                      1575
#define SMT1PRU_SMT1PR                1576
#define SMT1PR17                      1577
#define SMT1PR18                      1578
#define SMT1PR19                      1579
#define SMT1PR20                      1580
#define SMT1PR21                      1581
#define SMT1PR22                      1582
#define SMT1PR23                      1583
#define SMT1CON0                      1584
#define SMT1PS0                       1585
#define SMT1PS                        1586
#define SMT1PS1                       1587
#define SMT1CON0_CPOL                 1588
#define SMT1CON0_SPOL                 1589
#define SMT1CON0_WPOL                 1590
#define SMT1CON0_STP                  1591
#define SMT1EN                        1592
#define SMT1CON0_EN                   1593
#define SMT1CON1                      1594
#define SMT1CON1_MODE                 1595
#define SMT1CON1_MODE0                1596
#define SMT1CON1_MODE1                1597
#define SMT1CON1_MODE2                1598
#define SMT1CON1_MODE3                1599
#define SMT1CON1_REPEAT               1600
#define SMT1GO                        1601
#define SMT1STAT                      1602
#define SMT1STAT_AS                   1603
#define SMT1AS                        1604
#define SMT1STAT_WS                   1605
#define SMT1WS                        1606
#define SMT1STAT_TS                   1607
#define SMT1TS                        1608
#define SMT1RESET                     1609
#define SMT1STAT_RST                  1610
#define SMT1CPWUP                     1611
#define SMT1STAT_CPWUP                1612
#define SMT1CPRUP                     1613
#define SMT1STAT_CPRUP                1614
#define SMT1CLK                       1615
#define SMT1CLK_CSEL0                 1616
#define SMT1CSEL0                     1617
#define SMT1CSEL                      1618
#define SMT1CLK_CSEL                  1619
#define SMT1CSEL1                     1620
#define SMT1CLK_CSEL1                 1621
#define SMT1CSEL2                     1622
#define SMT1CLK_CSEL2                 1623
#define SMT1SIG                       1624
#define SMT1SSEL                      1625
#define SMT1SIG_SSEL0                 1626
#define SMT1SIG_SSEL                  1627
#define SMT1SSEL0                     1628
#define SMT1SIG_SSEL1                 1629
#define SMT1SSEL1                     1630
#define SMT1SIG_SSEL2                 1631
#define SMT1SSEL2                     1632
#define SMT1SIG_SSEL3                 1633
#define SMT1SSEL3                     1634
#define SMT1SIG_SSEL4                 1635
#define SMT1SSEL4                     1636
#define SMT1WIN                       1637
#define SMT1WSEL                      1638
#define SMT1WSEL0                     1639
#define SMT1WIN_WSEL0                 1640
#define SMT1WIN_WSEL                  1641
#define SMT1WSEL1                     1642
#define SMT1WIN_WSEL1                 1643
#define SMT1WIN_WSEL2                 1644
#define SMT1WSEL2                     1645
#define SMT1WIN_WSEL3                 1646
#define SMT1WSEL3                     1647
#define SMT1WIN_WSEL4                 1648
