tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18857_tdd.h
#define SMT1WSEL4                     1649
#define SMT2TMRL                      1650
#define SMT2TMRL_SMT2TMR              1651
#define SMT2TMR0                      1652
#define SMT2TMR1                      1653
#define SMT2TMR2                      1654
#define SMT2TMR3                      1655
#define SMT2TMR4                      1656
#define SMT2TMR5                      1657
#define SMT2TMR6                      1658
#define SMT2TMR7                      1659
#define SMT2TMRH                      1660
#define SMT2TMR8                      1661
#define SMT2TMRH_SMT2TMR              1662
#define SMT2TMR9                      1663
#define SMT2TMR10                     1664
#define SMT2TMR11                     1665
#define SMT2TMR12                     1666
#define SMT2TMR13                     1667
#define SMT2TMR14                     1668
#define SMT2TMR15                     1669
#define SMT2TMRU                      1670
#define SMT2TMR16                     1671
#define SMT2TMRU_SMT2TMR              1672
#define SMT2TMR17                     1673
#define SMT2TMR18                     1674
#define SMT2TMR19                     1675
#define SMT2TMR20                     1676
#define SMT2TMR21                     1677
#define SMT2TMR22                     1678
#define SMT2TMR23                     1679
#define SMT2CPRL                      1680
#define SMT2CPRL_CPR0                 1681
#define SMT2CPRL_SMT2CPR              1682
#define SMT2CPRL_CPR                  1683
#define SMT2CPRL_CPR1                 1684
#define SMT2CPRL_CPR2                 1685
#define SMT2CPRL_CPR3                 1686
#define SMT2CPRL_CPR4                 1687
#define SMT2CPRL_CPR5                 1688
#define SMT2CPRL_CPR6                 1689
#define SMT2CPRL_CPR7                 1690
#define SMT2CPRH                      1691
#define SMT2CPRH_CPR8                 1692
#define SMT2CPRH_SMT2CPR              1693
#define SMT2CPR8                      1694
#define SMT2CPRH_CPR                  1695
#define SMT2CPRH_CPR9                 1696
#define SMT2CPR9                      1697
#define SMT2CPRH_CPR10                1698
#define SMT2CPR10                     1699
#define SMT2CPRH_CPR11                1700
#define SMT2CPR11                     1701
#define SMT2CPRH_CPR12                1702
#define SMT2CPR12                     1703
#define SMT2CPRH_CPR13                1704
#define SMT2CPR13                     1705
#define SMT2CPRH_CPR14                1706
#define SMT2CPR14                     1707
#define SMT2CPRH_CPR15                1708
#define SMT2CPR15                     1709
#define SMT2CPRU                      1710
#define SMT2CPRU_CPR16                1711
#define SMT2CPRU_CPR                  1712
#define SMT2CPRU_SMT2CPR              1713
#define SMT2CPR16                     1714
#define SMT2CPRU_CPR17                1715
#define SMT2CPR17                     1716
#define SMT2CPRU_CPR18                1717
#define SMT2CPR18                     1718
#define SMT2CPRU_CPR19                1719
#define SMT2CPR19                     1720
#define SMT2CPR20                     1721
#define SMT2CPRU_CPR20                1722
#define SMT2CPR21                     1723
#define SMT2CPRU_CPR21                1724
#define SMT2CPR22                     1725
#define SMT2CPRU_CPR22                1726
#define SMT2CPR23                     1727
#define SMT2CPRU_CPR23                1728
#define SMT2CPWL                      1729
#define SMT2CPW0                      1730
#define SMT2CPWL_CPW0                 1731
#define SMT2CPWL_CPW                  1732
#define SMT2CPWL_SMT2CPW              1733
#define SMT2CPW1                      1734
#define SMT2CPWL_CPW1                 1735
#define SMT2CPW2                      1736
#define SMT2CPWL_CPW2                 1737
#define SMT2CPW3                      1738
#define SMT2CPWL_CPW3                 1739
#define SMT2CPW4                      1740
#define SMT2CPWL_CPW4                 1741
#define SMT2CPW5                      1742
#define SMT2CPWL_CPW5                 1743
#define SMT2CPW6                      1744
#define SMT2CPWL_CPW6                 1745
#define SMT2CPW7                      1746
#define SMT2CPWL_CPW7                 1747
#define SMT2CPWH                      1748
#define SMT2CPWH_CPW8                 1749
#define SMT2CPW8                      1750
#define SMT2CPWH_SMT2CPW              1751
#define SMT2CPWH_CPW                  1752
#define SMT2CPWH_CPW9                 1753
#define SMT2CPW9                      1754
#define SMT2CPWH_CPW10                1755
#define SMT2CPW10                     1756
#define SMT2CPW11                     1757
#define SMT2CPWH_CPW11                1758
#define SMT2CPWH_CPW12                1759
#define SMT2CPW12                     1760
#define SMT2CPWH_CPW13                1761
#define SMT2CPW13                     1762
#define SMT2CPW14                     1763
#define SMT2CPWH_CPW14                1764
#define SMT2CPW15                     1765
#define SMT2CPWH_CPW15                1766
#define SMT2CPWU                      1767
#define SMT2CPWU_CPW16                1768
#define SMT2CPW16                     1769
#define SMT2CPWU_SMT2CPW              1770
#define SMT2CPWU_CPW                  1771
#define SMT2CPWU_CPW17                1772
#define SMT2CPW17                     1773
#define SMT2CPWU_CPW18                1774
#define SMT2CPW18                     1775
#define SMT2CPWU_CPW19                1776
#define SMT2CPW19                     1777
#define SMT2CPW20                     1778
#define SMT2CPWU_CPW20                1779
#define SMT2CPW21                     1780
#define SMT2CPWU_CPW21                1781
#define SMT2CPW22                     1782
#define SMT2CPWU_CPW22                1783
#define SMT2CPW23                     1784
#define SMT2CPWU_CPW23                1785
#define SMT2PRL                       1786
#define SMT2PRL_SMT2PR                1787
#define SMT2PR0                       1788
#define SMT2PR1                       1789
#define SMT2PR2                       1790
#define SMT2PR3                       1791
#define SMT2PR4                       1792
#define SMT2PR5                       1793
#define SMT2PR6                       1794
#define SMT2PR7                       1795
#define SMT2PRH                       1796
#define SMT2PRH_SMT2PR                1797
#define SMT2PR8                       1798
#define SMT2PR9                       1799
#define SMT2PR10                      1800
#define SMT2PR11                      1801
#define SMT2PR12                      1802
#define SMT2PR13                      1803
#define SMT2PR14                      1804
#define SMT2PR15                      1805
#define SMT2PRU                       1806
#define SMT2PRU_SMT2PR                1807
#define SMT2PR16                      1808
#define SMT2PR17                      1809
#define SMT2PR18                      1810
#define SMT2PR19                      1811
#define SMT2PR20                      1812
#define SMT2PR21                      1813
#define SMT2PR22                      1814
#define SMT2PR23                      1815
#define SMT2CON0                      1816
#define SMT2PS0                       1817
#define SMT2PS                        1818
#define SMT2PS1                       1819
#define SMT2CON0_CPOL                 1820
#define SMT2CON0_SPOL                 1821
#define SMT2CON0_WPOL                 1822
#define SMT2CON0_STP                  1823
#define SMT2CON0_EN                   1824
#define SMT2EN                        1825
#define SMT2CON1                      1826
#define SMT2CON1_MODE                 1827
#define SMT2CON1_MODE0                1828
#define SMT2CON1_MODE1                1829
#define SMT2CON1_MODE2                1830
#define SMT2CON1_MODE3                1831
#define SMT2CON1_REPEAT               1832
#define SMT2GO                        1833
#define SMT2STAT                      1834
#define SMT2AS                        1835
#define SMT2STAT_AS                   1836
#define SMT2WS                        1837
#define SMT2STAT_WS                   1838
#define SMT2STAT_TS                   1839
#define SMT2TS                        1840
#define SMT2RESET                     1841
#define SMT2STAT_RST                  1842
#define SMT2CPWUP                     1843
#define SMT2STAT_CPWUP                1844
#define SMT2STAT_CPRUP                1845
#define SMT2CPRUP                     1846
#define SMT2CLK                       1847
#define SMT2CLK_CSEL                  1848
#define SMT2CLK_CSEL0                 1849
#define SMT2CSEL0                     1850
#define SMT2CSEL                      1851
#define SMT2CLK_CSEL1                 1852
#define SMT2CSEL1                     1853
#define SMT2CLK_CSEL2                 1854
#define SMT2CSEL2                     1855
#define SMT2SIG                       1856
#define SMT2SIG_SSEL                  1857
#define SMT2SSEL0                     1858
#define SMT2SSEL                      1859
#define SMT2SIG_SSEL0                 1860
#define SMT2SSEL1                     1861
#define SMT2SIG_SSEL1                 1862
#define SMT2SSEL2                     1863
#define SMT2SIG_SSEL2                 1864
#define SMT2SIG_SSEL3                 1865
#define SMT2SSEL3                     1866
#define SMT2SSEL4                     1867
#define SMT2SIG_SSEL4                 1868
#define SMT2WIN                       1869
#define SMT2WIN_WSEL0                 1870
#define SMT2WSEL0                     1871
#define SMT2WSEL                      1872
#define SMT2WIN_WSEL                  1873
#define SMT2WSEL1                     1874
#define SMT2WIN_WSEL1                 1875
#define SMT2WSEL2                     1876
#define SMT2WIN_WSEL2                 1877
#define SMT2WSEL3                     1878
#define SMT2WIN_WSEL3                 1879
#define SMT2WSEL4                     1880
#define SMT2WIN_WSEL4                 1881
#define NCO1ACCL                      1882
#define NCO1ACCL_NCO1ACC              1883
#define NCO1ACC0                      1884
#define NCO1ACC1                      1885
#define NCO1ACC2                      1886
#define NCO1ACC3                      1887
#define NCO1ACC4                      1888
#define NCO1ACC5                      1889
#define NCO1ACC6                      1890
#define NCO1ACC7                      1891
#define NCO1ACCH                      1892
#define NCO1ACC8                      1893
#define NCO1ACCH_NCO1ACC              1894
#define NCO1ACC9                      1895
#define NCO1ACC10                     1896
#define NCO1ACC11                     1897
#define NCO1ACC12                     1898
#define NCO1ACC13                     1899
#define NCO1ACC14                     1900
#define NCO1ACC15                     1901
#define NCO1ACCU                      1902
#define NCO1ACCU_NCO1ACC              1903
#define NCO1ACC16                     1904
#define NCO1ACC17                     1905
#define NCO1ACC18                     1906
#define NCO1ACC19                     1907
#define NCO1INCL                      1908
#define NCO1INC0                      1909
#define NCO1INCL_NCO1INC              1910
#define NCO1INC1                      1911
#define NCO1INC2                      1912
#define NCO1INC3                      1913
#define NCO1INC4                      1914
#define NCO1INC5                      1915
#define NCO1INC6                      1916
#define NCO1INC7                      1917
#define NCO1INCH                      1918
#define NCO1INCH_NCO1INC              1919
#define NCO1INC8                      1920
#define NCO1INC9                      1921
#define NCO1INC10                     1922
#define NCO1INC11                     1923
#define NCO1INC12                     1924
#define NCO1INC13                     1925
#define NCO1INC14                     1926
#define NCO1INC15                     1927
#define NCO1INCU                      1928
#define NCO1INC16                     1929
#define NCO1INCU_NCO1INC              1930
#define NCO1INC17                     1931
#define NCO1INC18                     1932
#define NCO1INC19                     1933
#define NCO1CON                       1934
#define N1PFM                         1935
#define N1POL                         1936
#define N1OUT                         1937
#define N1EN                          1938
#define NCO1CLK                       1939
#define N1CKS                         1940
#define N1CKS0                        1941
#define N1CKS1                        1942
#define N1CKS2                        1943
#define N1PWS0                        1944
#define N1PWS                         1945
#define N1PWS1                        1946
#define N1PWS2                        1947
#define CWG1CLKCON                    1948
#define CWG1CLKCON_CS                 1949
#define CWG1CS                        1950
#define CWG1ISM                       1951
#define CWG1ISM_IS                    1952
#define CWG1ISM0                      1953
#define CWG1ISM1                      1954
#define CWG1ISM2                      1955
#define CWG1ISM3                      1956
#define CWG1DBR_DBR                   1957
#define CWG1DBR0                      1958
#define CWG1DBR_DBR0                  1959
#define CWG1DBR                       1960
#define CWG1DBR1                      1961
#define CWG1DBR_DBR1                  1962
#define CWG1DBR2                      1963
#define CWG1DBR_DBR2                  1964
#define CWG1DBR3                      1965
#define CWG1DBR_DBR3                  1966
#define CWG1DBR_DBR4                  1967
#define CWG1DBR4                      1968
#define CWG1DBR5                      1969
#define CWG1DBR_DBR5                  1970
#define CWG1DBF                       1971
#define CWG1DBF0                      1972
#define CWG1DBF_DBF                   1973
#define CWG1DBF_DBF0                  1974
#define CWG1DBF1                      1975
#define CWG1DBF_DBF1                  1976
#define CWG1DBF_DBF2                  1977
#define CWG1DBF2                      1978
#define CWG1DBF3                      1979
#define CWG1DBF_DBF3                  1980
#define CWG1DBF_DBF4                  1981
#define CWG1DBF4                      1982
#define CWG1DBF_DBF5                  1983
#define CWG1DBF5                      1984
#define CWG1CON0                      1985
#define CWG1MODE0                     1986
#define CWG1CON0_MODE0                1987
#define CWG1MODE                      1988
#define CWG1CON0_MODE                 1989
#define CWG1MODE1                     1990
#define CWG1CON0_MODE1                1991
#define CWG1MODE2                     1992
#define CWG1CON0_MODE2                1993
#define CWG1CON0_LD                   1994
#define CWG1LD                        1995
#define CWG1CON0_EN                   1996
#define CWG1EN                        1997
#define G1EN                          1998
#define CWG1CON1                      1999
#define CWG1POLA                      2000
#define CWG1CON1_POLA                 2001
#define CWG1CON1_POLB                 2002
#define CWG1POLB                      2003
#define CWG1POLC                      2004
#define CWG1CON1_POLC                 2005
#define CWG1CON1_POLD                 2006
#define CWG1POLD                      2007
#define CWG1CON1_IN                   2008
#define CWG1IN                        2009
#define CWG1AS0                       2010
#define CWG1LSAC                      2011
#define CWG1AS0_LSAC0                 2012
#define CWG1AS0_LSAC                  2013
#define CWG1LSAC0                     2014
#define CWG1AS0_LSAC1                 2015
#define CWG1LSAC1                     2016
#define CWG1AS0_LSBD0                 2017
#define CWG1LSBD0                     2018
#define CWG1LSBD                      2019
#define CWG1AS0_LSBD                  2020
#define CWG1LSBD1                     2021
#define CWG1AS0_LSBD1                 2022
#define CWG1AS0_REN                   2023
#define CWG1REN                       2024
#define CWG1AS0_SHUTDOWN              2025
#define CWG1SHUTDOWN                  2026
#define CWG1AS1                       2027
#define CWG1AS1_AS0E                  2028
#define CWG1AS1_AS1E                  2029
#define CWG1AS1_AS2E                  2030
#define CWG1AS1_AS3E                  2031
#define CWG1AS1_AS4E                  2032
#define CWG1AS1_AS5E                  2033
#define CWG1AS1_AS6E                  2034
#define CWG1STR                       2035
#define CWG1STRA                      2036
#define CWG1STR_STRA                  2037
#define CWG1STRB                      2038
#define CWG1STR_STRB                  2039
#define CWG1STRC                      2040
#define CWG1STR_STRC                  2041
#define CWG1STR_STRD                  2042
#define CWG1STRD                      2043
#define CWG1OVRA                      2044
#define CWG1STR_OVRA                  2045
#define CWG1OVRB                      2046
#define CWG1STR_OVRB                  2047
#define CWG1OVRC                      2048
#define CWG1STR_OVRC                  2049
#define CWG1OVRD                      2050
#define CWG1STR_OVRD                  2051
#define CWG2CLKCON                    2052
#define CWG2CS                        2053
#define CWG2CLKCON_CS                 2054
#define CWG2ISM                       2055
#define CWG2ISM0                      2056
#define CWG2ISM_IS                    2057
#define CWG2ISM1                      2058
#define CWG2ISM2                      2059
#define CWG2ISM3                      2060
#define CWG2DBR_DBR                   2061
#define CWG2DBR_DBR0                  2062
#define CWG2DBR                       2063
#define CWG2DBR0                      2064
#define CWG2DBR_DBR1                  2065
#define CWG2DBR1                      2066
#define CWG2DBR_DBR2                  2067
#define CWG2DBR2                      2068
#define CWG2DBR_DBR3                  2069
#define CWG2DBR3                      2070
#define CWG2DBR_DBR4                  2071
#define CWG2DBR4                      2072
#define CWG2DBR_DBR5                  2073
#define CWG2DBR5                      2074
#define CWG2DBF                       2075
#define CWG2DBF_DBF0                  2076
#define CWG2DBF_DBF                   2077
#define CWG2DBF0                      2078
#define CWG2DBF_DBF1                  2079
#define CWG2DBF1                      2080
#define CWG2DBF_DBF2                  2081
#define CWG2DBF2                      2082
#define CWG2DBF_DBF3                  2083
#define CWG2DBF3                      2084
#define CWG2DBF_DBF4                  2085
#define CWG2DBF4                      2086
#define CWG2DBF5                      2087
#define CWG2DBF_DBF5                  2088
#define CWG2CON0                      2089
#define CWG2MODE                      2090
#define CWG2MODE0                     2091
#define CWG2CON0_MODE                 2092
#define CWG2CON0_MODE0                2093
#define CWG2MODE1                     2094
#define CWG2CON0_MODE1                2095
#define CWG2MODE2                     2096
#define CWG2CON0_MODE2                2097
#define CWG2LD                        2098
#define CWG2CON0_LD                   2099
#define CWG2CON0_EN                   2100
#define CWG2EN                        2101
#define G2EN                          2102
#define CWG2CON1                      2103
#define CWG2POLA                      2104
#define CWG2CON1_POLA                 2105
#define CWG2POLB                      2106
#define CWG2CON1_POLB                 2107
#define CWG2POLC                      2108
#define CWG2CON1_POLC                 2109
#define CWG2CON1_POLD                 2110
#define CWG2POLD                      2111
#define CWG2IN                        2112
#define CWG2CON1_IN                   2113
#define CWG2AS0                       2114
#define CWG2LSAC                      2115
#define CWG2AS0_LSAC                  2116
#define CWG2LSAC0                     2117
#define CWG2AS0_LSAC0                 2118
#define CWG2LSAC1                     2119
#define CWG2AS0_LSAC1                 2120
#define CWG2AS0_LSBD0                 2121
#define CWG2LSBD                      2122
#define CWG2AS0_LSBD                  2123
#define CWG2LSBD0                     2124
#define CWG2AS0_LSBD1                 2125
#define CWG2LSBD1                     2126
#define CWG2AS0_REN                   2127
#define CWG2REN                       2128
#define CWG2AS0_SHUTDOWN              2129
#define CWG2SHUTDOWN                  2130
#define CWG2AS1                       2131
#define CWG2AS1_AS0E                  2132
#define CWG2AS1_AS1E                  2133
#define CWG2AS1_AS2E                  2134
#define CWG2AS1_AS3E                  2135
#define CWG2AS1_AS4E                  2136
#define CWG2AS1_AS5E                  2137
#define CWG2AS1_AS6E                  2138
#define CWG2STR                       2139
#define CWG2STR_STRA                  2140
#define CWG2STRA                      2141
#define CWG2STR_STRB                  2142
#define CWG2STRB                      2143
#define CWG2STR_STRC                  2144
#define CWG2STRC                      2145
#define CWG2STR_STRD                  2146
#define CWG2STRD                      2147
#define CWG2STR_OVRA                  2148
#define CWG2OVRA                      2149
#define CWG2OVRB                      2150
#define CWG2STR_OVRB                  2151
#define CWG2STR_OVRC                  2152
#define CWG2OVRC                      2153
#define CWG2OVRD                      2154
#define CWG2STR_OVRD                  2155
#define CWG3CLKCON                    2156
#define CWG3CS                        2157
#define CWG3CLKCON_CS                 2158
#define CWG3ISM                       2159
#define CWG3ISM_IS                    2160
#define CWG3ISM0                      2161
#define CWG3ISM1                      2162
#define CWG3ISM2                      2163
#define CWG3ISM3                      2164
#define CWG3DBR                       2165
#define CWG3DBR0                      2166
#define CWG3DBR_DBR0                  2167
#define CWG3DBR_DBR                   2168
#define CWG3DBR_DBR1                  2169
#define CWG3DBR1                      2170
#define CWG3DBR_DBR2                  2171
#define CWG3DBR2                      2172
#define CWG3DBR_DBR3                  2173
#define CWG3DBR3                      2174
#define CWG3DBR_DBR4                  2175
#define CWG3DBR4                      2176
#define CWG3DBR_DBR5                  2177
#define CWG3DBR5                      2178
#define CWG3DBF0                      2179
#define CWG3DBF_DBF0                  2180
#define CWG3DBF                       2181
#define CWG3DBF_DBF                   2182
#define CWG3DBF1                      2183
#define CWG3DBF_DBF1                  2184
#define CWG3DBF2                      2185
#define CWG3DBF_DBF2                  2186
#define CWG3DBF3                      2187
#define CWG3DBF_DBF3                  2188
#define CWG3DBF4                      2189
#define CWG3DBF_DBF4                  2190
#define CWG3DBF5                      2191
#define CWG3DBF_DBF5                  2192
#define CWG3CON0                      2193
#define CWG3MODE                      2194
#define CWG3MODE0                     2195
#define CWG3CON0_MODE                 2196
#define CWG3CON0_MODE0                2197
#define CWG3MODE1                     2198
#define CWG3CON0_MODE1                2199
#define CWG3MODE2                     2200
#define CWG3CON0_MODE2                2201
#define CWG3LD                        2202
#define CWG3CON0_LD                   2203
#define G3EN                          2204
#define CWG3EN                        2205
#define CWG3CON0_EN                   2206
