tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18857_tdd.h
#define CWG3CON1                      2207
#define CWG3CON1_POLA                 2208
#define CWG3POLA                      2209
#define CWG3CON1_POLB                 2210
#define CWG3POLB                      2211
#define CWG3CON1_POLC                 2212
#define CWG3POLC                      2213
#define CWG3POLD                      2214
#define CWG3CON1_POLD                 2215
#define CWG3IN                        2216
#define CWG3CON1_IN                   2217
#define CWG3AS0                       2218
#define CWG3AS0_LSAC                  2219
#define CWG3LSAC0                     2220
#define CWG3AS0_LSAC0                 2221
#define CWG3LSAC                      2222
#define CWG3LSAC1                     2223
#define CWG3AS0_LSAC1                 2224
#define CWG3LSBD                      2225
#define CWG3AS0_LSBD                  2226
#define CWG3LSBD0                     2227
#define CWG3AS0_LSBD0                 2228
#define CWG3LSBD1                     2229
#define CWG3AS0_LSBD1                 2230
#define CWG3AS0_REN                   2231
#define CWG3REN                       2232
#define CWG3SHUTDOWN                  2233
#define CWG3AS0_SHUTDOWN              2234
#define CWG3AS1                       2235
#define CWG3AS1_AS0E                  2236
#define CWG3AS1_AS1E                  2237
#define CWG3AS1_AS2E                  2238
#define CWG3AS1_AS3E                  2239
#define CWG3AS1_AS4E                  2240
#define CWG3AS1_AS5E                  2241
#define CWG3AS1_AS6E                  2242
#define CWG3STR                       2243
#define CWG3STRA                      2244
#define CWG3STR_STRA                  2245
#define CWG3STRB                      2246
#define CWG3STR_STRB                  2247
#define CWG3STRC                      2248
#define CWG3STR_STRC                  2249
#define CWG3STR_STRD                  2250
#define CWG3STRD                      2251
#define CWG3STR_OVRA                  2252
#define CWG3OVRA                      2253
#define CWG3STR_OVRB                  2254
#define CWG3OVRB                      2255
#define CWG3STR_OVRC                  2256
#define CWG3OVRC                      2257
#define CWG3OVRD                      2258
#define CWG3STR_OVRD                  2259
#define PIR0                          2260
#define INTF                          2261
#define IOCIF                         2262
#define TMR0IF                        2263
#define PIR1                          2264
#define ADIF                          2265
#define ADTIF                         2266
#define CSWIF                         2267
#define OSFIF                         2268
#define PIR2                          2269
#define C1IF                          2270
#define C2IF                          2271
#define ZCDIF                         2272
#define PIR3                          2273
#define SSP1IF                        2274
#define BCL1IF                        2275
#define SSP2IF                        2276
#define BCL2IF                        2277
#define TXIF                          2278
#define RCIF                          2279
#define PIR4                          2280
#define TMR1IF                        2281
#define TMR2IF                        2282
#define TMR3IF                        2283
#define TMR4IF                        2284
#define TMR5IF                        2285
#define TMR6IF                        2286
#define PIR5                          2287
#define TMR1GIF                       2288
#define TMR3GIF                       2289
#define TMR5GIF                       2290
#define CLC1IF                        2291
#define CLC2IF                        2292
#define CLC3IF                        2293
#define CLC4IF                        2294
#define PIR6                          2295
#define CCP1IF                        2296
#define CCP2IF                        2297
#define CCP3IF                        2298
#define CCP4IF                        2299
#define CCP5IF                        2300
#define PIR7                          2301
#define CWG1IF                        2302
#define CWG2IF                        2303
#define CWG3IF                        2304
#define NCO1IF                        2305
#define NCOIF                         2306
#define NVMIF                         2307
#define CRCIF                         2308
#define SCANIF                        2309
#define PIR8                          2310
#define SMT1IF                        2311
#define SMT1PRAIF                     2312
#define SMT1PWAIF                     2313
#define SMT2IF                        2314
#define SMT2PRAIF                     2315
#define SMT2PWAIF                     2316
#define PIE0                          2317
#define INTE                          2318
#define IOCIE                         2319
#define TMR0IE                        2320
#define PIE1                          2321
#define ADIE                          2322
#define ADTIE                         2323
#define CSWIE                         2324
#define OSFIE                         2325
#define PIE2                          2326
#define C1IE                          2327
#define C2IE                          2328
#define ZCDIE                         2329
#define PIE3                          2330
#define SSP1IE                        2331
#define BCL1IE                        2332
#define SSP2IE                        2333
#define BCL2IE                        2334
#define TXIE                          2335
#define RCIE                          2336
#define PIE4                          2337
#define TMR1IE                        2338
#define TMR2IE                        2339
#define TMR3IE                        2340
#define TMR4IE                        2341
#define TMR5IE                        2342
#define TMR6IE                        2343
#define PIE5                          2344
#define TMR1GIE                       2345
#define TMR3GIE                       2346
#define TMR5GIE                       2347
#define CLC1IE                        2348
#define CLC2IE                        2349
#define CLC3IE                        2350
#define CLC4IE                        2351
#define PIE6                          2352
#define CCP1IE                        2353
#define CCP2IE                        2354
#define CCP3IE                        2355
#define CCP4IE                        2356
#define CCP5IE                        2357
#define PIE7                          2358
#define CWG1IE                        2359
#define CWG2IE                        2360
#define CWG3IE                        2361
#define NCO1IE                        2362
#define NCOIE                         2363
#define NVMIE                         2364
#define CRCIE                         2365
#define SCANIE                        2366
#define PIE8                          2367
#define SMT1IE                        2368
#define SMT1PRAIE                     2369
#define SMT1PWAIE                     2370
#define SMT2IE                        2371
#define SMT2PRAIE                     2372
#define SMT2PWAIE                     2373
#define PMD0                          2374
#define IOCMD                         2375
#define CLKRMD                        2376
#define NVMMD                         2377
#define SCANMD                        2378
#define CRCMD                         2379
#define FVRMD                         2380
#define SYSCMD                        2381
#define PMD1                          2382
#define TMR0MD                        2383
#define TMR1MD                        2384
#define TMR2MD                        2385
#define TMR3MD                        2386
#define TMR4MD                        2387
#define TMR5MD                        2388
#define TMR6MD                        2389
#define NCOMD                         2390
#define NCO1MD                        2391
#define PMD2                          2392
#define ZCDMD                         2393
#define CMP1MD                        2394
#define CMP2MD                        2395
#define ADCMD                         2396
#define DACMD                         2397
#define PMD3                          2398
#define CCP1MD                        2399
#define CCP2MD                        2400
#define CCP3MD                        2401
#define CCP4MD                        2402
#define CCP5MD                        2403
#define PWM6MD                        2404
#define PWM7MD                        2405
#define PMD4                          2406
#define CWG1MD                        2407
#define CWG2MD                        2408
#define CWG3MD                        2409
#define MSSP1MD                       2410
#define MSSP2MD                       2411
#define UART1MD                       2412
#define PMD5                          2413
#define DSMMD                         2414
#define CLC1MD                        2415
#define CLC2MD                        2416
#define CLC3MD                        2417
#define CLC4MD                        2418
#define SMT1MD                        2419
#define SMT2MD                        2420
#define WDTCON0                       2421
#define WDTCON0_SEN                   2422
#define SWDTEN                        2423
#define WDTSEN                        2424
#define WDTPS                         2425
#define WDTPS0                        2426
#define WDTPS1                        2427
#define WDTPS2                        2428
#define WDTPS3                        2429
#define WDTPS4                        2430
#define WDTCON1                       2431
#define WDTWINDOW0                    2432
#define WINDOW0                       2433
#define WINDOW                        2434
#define WDTWINDOW                     2435
#define WDTWINDOW1                    2436
#define WINDOW1                       2437
#define WDTWINDOW2                    2438
#define WINDOW2                       2439
#define WDTCS                         2440
#define WDTCS0                        2441
#define WDTCS1                        2442
#define WDTCS2                        2443
#define WDTPSL                        2444
#define WDTPSL_WDTPSCNT               2445
#define WDTPSL_PSCNT                  2446
#define WDTPSCNT0                     2447
#define PSCNT0                        2448
#define WDTPSCNT1                     2449
#define PSCNT1                        2450
#define WDTPSCNT2                     2451
#define PSCNT2                        2452
#define WDTPSCNT3                     2453
#define PSCNT3                        2454
#define WDTPSCNT4                     2455
#define PSCNT4                        2456
#define WDTPSCNT5                     2457
#define PSCNT5                        2458
#define WDTPSCNT6                     2459
#define PSCNT6                        2460
#define WDTPSCNT7                     2461
#define PSCNT7                        2462
#define WDTPSH                        2463
#define PSCNT8                        2464
#define WDTPSH_WDTPSCNT               2465
#define WDTPSH_PSCNT                  2466
#define WDTPSCNT8                     2467
#define PSCNT9                        2468
#define WDTPSCNT9                     2469
#define PSCNT10                       2470
#define WDTPSCNT10                    2471
#define PSCNT11                       2472
#define WDTPSCNT11                    2473
#define PSCNT12                       2474
#define WDTPSCNT12                    2475
#define PSCNT13                       2476
#define WDTPSCNT13                    2477
#define PSCNT14                       2478
#define WDTPSCNT14                    2479
#define PSCNT15                       2480
#define WDTPSCNT15                    2481
#define PSCNT16                       2482
#define WDTPSCNT16                    2483
#define WDTPSCNT17                    2484
#define PSCNT17                       2485
#define STATE                         2486
#define WDTSTATE                      2487
#define WDTTMR                        2488
#define WDTTMR0                       2489
#define WDTTMR1                       2490
#define WDTTMR2                       2491
#define WDTTMR3                       2492
#define BORCON                        2493
#define BORRDY                        2494
#define SBOREN                        2495
#define VREGCON                       2496
#define VREGPM                        2497
#define PCON0                         2498
#define nBOR                          2499
#define nPOR                          2500
#define nRI                           2501
#define nRMCLR                        2502
#define nRWDT                         2503
#define nWDTWV                        2504
#define STKUNF                        2505
#define STKOVF                        2506
#define CCDCON                        2507
#define CCDS0                         2508
#define CCDS1                         2509
#define CCDEN                         2510
#define NVMADRL                       2511
#define NVMADR0                       2512
#define NVMADR1                       2513
#define NVMADR2                       2514
#define NVMADR3                       2515
#define NVMADR4                       2516
#define NVMADR5                       2517
#define NVMADR6                       2518
#define NVMADR7                       2519
#define NVMADRH                       2520
#define NVMADR8                       2521
#define NVMADR9                       2522
#define NVMADR10                      2523
#define NVMADR11                      2524
#define NVMADR12                      2525
#define NVMADR13                      2526
#define NVMADR14                      2527
#define NVMDATL                       2528
#define NVMDAT0                       2529
#define NVMDAT1                       2530
#define NVMDAT2                       2531
#define NVMDAT3                       2532
#define NVMDAT4                       2533
#define NVMDAT5                       2534
#define NVMDAT6                       2535
#define NVMDAT7                       2536
#define NVMDATH                       2537
#define NVMDAT8                       2538
#define NVMDAT9                       2539
#define NVMDAT10                      2540
#define NVMDAT11                      2541
#define NVMDAT12                      2542
#define NVMDAT13                      2543
#define NVMCON1                       2544
#define RD                            2545
#define WR                            2546
#define WREN                          2547
#define WRERR                         2548
#define FREE                          2549
#define LWLO                          2550
#define NVMREGS                       2551
#define CPUDOZE                       2552
#define DOZE0                         2553
#define DOZE1                         2554
#define DOZE2                         2555
#define DOE                           2556
#define ROI                           2557
#define DOZEN                         2558
#define IDLEN                         2559
#define OSCCON1                       2560
#define NDIV0                         2561
#define NDIV                          2562
#define NDIV1                         2563
#define NDIV2                         2564
#define NDIV3                         2565
#define NOSC0                         2566
#define NOSC                          2567
#define NOSC1                         2568
#define NOSC2                         2569
#define OSCCON2                       2570
#define CDIV0                         2571
#define CDIV                          2572
#define CDIV1                         2573
#define CDIV2                         2574
#define CDIV3                         2575
#define COSC                          2576
#define COSC0                         2577
#define COSC1                         2578
#define COSC2                         2579
#define OSCCON3                       2580
#define NOSCR                         2581
#define ORDY                          2582
#define SOSCPWR                       2583
#define CSWHOLD                       2584
#define OSCSTAT                       2585
#define PLLR                          2586
#define ADOR                          2587
#define SOR                           2588
#define LFOR                          2589
#define MFOR                          2590
#define HFOR                          2591
#define EXTOR                         2592
#define OSCEN                         2593
#define ADOEN                         2594
#define SOSCEN                        2595
#define LFOEN                         2596
#define MFOEN                         2597
#define HFOEN                         2598
#define EXTOEN                        2599
#define OSCTUNE                       2600
#define HFTUN0                        2601
#define HFTUN                         2602
#define HFTUN1                        2603
#define HFTUN2                        2604
#define HFTUN3                        2605
#define HFTUN4                        2606
#define HFTUN5                        2607
#define OSCFRQ                        2608
#define HFFRQ                         2609
#define HFFRQ0                        2610
#define HFFRQ1                        2611
#define HFFRQ2                        2612
#define CLKRCON                       2613
#define CLKRDIV                       2614
#define CLKRDIV0                      2615
#define CLKRDIV1                      2616
#define CLKRDIV2                      2617
#define CLKRDC                        2618
#define CLKRDC0                       2619
#define CLKRDC1                       2620
#define CLKREN                        2621
#define CLKRCLK                       2622
#define CLKRCLK0                      2623
#define CLKRCLK1                      2624
#define CLKRCLK2                      2625
#define CLKRCLK3                      2626
#define MDCON0                        2627
#define MDBIT                         2628
#define MDOPOL                        2629
#define MDOUT                         2630
#define MDEN                          2631
#define MDCON1                        2632
#define MDCLSYNC                      2633
#define MDCLPOL                       2634
#define MDCHSYNC                      2635
#define MDCHPOL                       2636
#define MDSRC                         2637
#define MDMS0                         2638
#define MDMS                          2639
#define MDMS1                         2640
#define MDMS2                         2641
#define MDMS3                         2642
#define MDMS4                         2643
#define MDCARL                        2644
#define MDCL0                         2645
#define MDCL                          2646
#define MDCL1                         2647
#define MDCL2                         2648
#define MDCL3                         2649
#define MDCARH                        2650
#define MDCH                          2651
#define MDCH0                         2652
#define MDCH1                         2653
#define MDCH2                         2654
#define MDCH3                         2655
#define FVRCON                        2656
#define ADFVR0                        2657
#define ADFVR                         2658
#define ADFVR1                        2659
#define CDAFVR                        2660
#define CDAFVR0                       2661
#define CDAFVR1                       2662
#define TSRNG                         2663
#define TSEN                          2664
#define FVRRDY                        2665
#define FVREN                         2666
#define DAC1CON0                      2667
#define NSS                           2668
#define DAC1NSS                       2669
#define DAC1PSS0                      2670
#define PSS                           2671
#define PSS0                          2672
#define PSS1                          2673
#define DAC1PSS1                      2674
#define OE2                           2675
#define DAC1OE2                       2676
#define OE1                           2677
#define DAC1OE1                       2678
#define DAC1CON0_EN                   2679
#define DAC1EN                        2680
#define DAC1CON1                      2681
#define DAC1R                         2682
#define DAC1R0                        2683
#define DAC1R1                        2684
#define DAC1R2                        2685
#define DAC1R3                        2686
#define DAC1R4                        2687
#define ZCDCON                        2688
#define ZCDINTN                       2689
#define ZCDINTP                       2690
#define ZCDPOL                        2691
#define ZCDOUT                        2692
#define ZCDSEN                        2693
#define CMOUT                         2694
#define CMOUT_C1OUT                   2695
#define MC1OUT                        2696
#define MC2OUT                        2697
#define CMOUT_C2OUT                   2698
#define CM1CON0                       2699
#define CM1CON0_SYNC                  2700
#define C1SYNC                        2701
#define CM1CON0_HYS                   2702
#define C1HYS                         2703
#define C1SP                          2704
#define CM1CON0_POL                   2705
#define C1POL                         2706
#define CM1CON0_OUT                   2707
#define CM1CON0_C1OUT                 2708
#define CM1CON0_ON                    2709
#define C1ON                          2710
#define CM1CON1                       2711
#define C1INTN                        2712
#define CM1CON1_INTN                  2713
#define CM1CON1_INTP                  2714
#define C1INTP                        2715
#define CM1NSEL                       2716
#define CM1NSEL_NCH0                  2717
#define C1NCH0                        2718
#define CM1NSEL_NCH                   2719
#define C1NCH                         2720
#define CM1NSEL_NCH1                  2721
#define C1NCH1                        2722
#define CM1NSEL_NCH2                  2723
#define C1NCH2                        2724
#define CM1PSEL                       2725
#define CM1PSEL_PCH                   2726
#define C1PCH                         2727
#define C1PCH0                        2728
#define CM1PSEL_PCH0                  2729
#define C1PCH1                        2730
#define CM1PSEL_PCH1                  2731
#define C1PCH2                        2732
#define CM1PSEL_PCH2                  2733
#define CM2CON0                       2734
#define CM2CON0_SYNC                  2735
#define C2SYNC                        2736
#define C2HYS                         2737
#define CM2CON0_HYS                   2738
#define C2SP                          2739
#define C2POL                         2740
#define CM2CON0_POL                   2741
#define CM2CON0_C2OUT                 2742
#define CM2CON0_OUT                   2743
#define CM2CON0_ON                    2744
#define C2ON                          2745
#define CM2CON1                       2746
#define C2INTN                        2747
#define CM2CON1_INTN                  2748
#define CM2CON1_INTP                  2749
#define C2INTP                        2750
#define CM2NSEL                       2751
#define C2NCH0                        2752
#define CM2NSEL_NCH0                  2753
#define C2NCH                         2754
#define CM2NSEL_NCH                   2755
#define C2NCH1                        2756
#define CM2NSEL_NCH1                  2757
#define C2NCH2                        2758
#define CM2NSEL_NCH2                  2759
#define CM2PSEL                       2760
#define CM2PSEL_PCH                   2761
#define C2PCH                         2762
#define C2PCH0                        2763
#define CM2PSEL_PCH0                  2764
