tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18857_tdd.h
#define C2PCH1                        2765
#define CM2PSEL_PCH1                  2766
#define CM2PSEL_PCH2                  2767
#define C2PCH2                        2768
#define CLCDATA                       2769
#define MLC1OUT                       2770
#define MLC2OUT                       2771
#define MLC3OUT                       2772
#define MLC4OUT                       2773
#define CLC1CON                       2774
#define CLC1CON_MODE                  2775
#define LC1MODE0                      2776
#define LC1MODE                       2777
#define CLC1CON_MODE0                 2778
#define LC1MODE1                      2779
#define CLC1CON_MODE1                 2780
#define LC1MODE2                      2781
#define CLC1CON_MODE2                 2782
#define LC1INTN                       2783
#define CLC1CON_INTN                  2784
#define LC1INTP                       2785
#define CLC1CON_INTP                  2786
#define LC1OUT                        2787
#define CLC1CON_OUT                   2788
#define LC1EN                         2789
#define CLC1CON_EN                    2790
#define CLC1POL                       2791
#define LC1G1POL                      2792
#define CLC1POL_G1POL                 2793
#define CLC1POL_G2POL                 2794
#define LC1G2POL                      2795
#define LC1G3POL                      2796
#define CLC1POL_G3POL                 2797
#define LC1G4POL                      2798
#define CLC1POL_G4POL                 2799
#define CLC1POL_POL                   2800
#define LC1POL                        2801
#define CLC1SEL0                      2802
#define LC1D1S                        2803
#define CLC1SEL0_D1S0                 2804
#define LC1D1S0                       2805
#define CLC1SEL0_D1S                  2806
#define CLC1SEL0_D1S1                 2807
#define LC1D1S1                       2808
#define CLC1SEL0_D1S2                 2809
#define LC1D1S2                       2810
#define CLC1SEL0_D1S3                 2811
#define LC1D1S3                       2812
#define LC1D1S4                       2813
#define CLC1SEL0_D1S4                 2814
#define CLC1SEL0_D1S5                 2815
#define LC1D1S5                       2816
#define LC1D1S6                       2817
#define CLC1SEL0_D1S6                 2818
#define LC1D1S7                       2819
#define CLC1SEL0_D1S7                 2820
#define CLC1SEL1                      2821
#define CLC1SEL1_D2S                  2822
#define CLC1SEL1_D2S0                 2823
#define LC1D2S0                       2824
#define LC1D2S                        2825
#define CLC1SEL1_D2S1                 2826
#define LC1D2S1                       2827
#define CLC1SEL1_D2S2                 2828
#define LC1D2S2                       2829
#define CLC1SEL1_D2S3                 2830
#define LC1D2S3                       2831
#define LC1D2S4                       2832
#define CLC1SEL1_D2S4                 2833
#define D2S5                          2834
#define LC1D2S5                       2835
#define LC1D2S6                       2836
#define CLC1SEL1_D2S6                 2837
#define CLC1SEL1_D2S7                 2838
#define LC1D2S7                       2839
#define CLC1SEL2                      2840
#define CLC1SEL2_D3S                  2841
#define LC1D3S0                       2842
#define LC1D3S                        2843
#define CLC1SEL2_D3S0                 2844
#define LC1D3S1                       2845
#define CLC1SEL2_D3S1                 2846
#define LC1D3S2                       2847
#define CLC1SEL2_D3S2                 2848
#define LC1D3S3                       2849
#define CLC1SEL2_D3S3                 2850
#define LC1D3S4                       2851
#define CLC1SEL2_D3S4                 2852
#define LC1D3S5                       2853
#define CLC1SEL2_D3S5                 2854
#define LC1D3S6                       2855
#define CLC1SEL2_D3S6                 2856
#define LC1D3S7                       2857
#define CLC1SEL2_D3S7                 2858
#define CLC1SEL3                      2859
#define LC1D4S                        2860
#define CLC1SEL3_D4S                  2861
#define LC1D4S0                       2862
#define CLC1SEL3_D4S0                 2863
#define LC1D4S1                       2864
#define CLC1SEL3_D4S1                 2865
#define LC1D4S2                       2866
#define CLC1SEL3_D4S2                 2867
#define LC1D4S3                       2868
#define CLC1SEL3_D4S3                 2869
#define LC1D4S4                       2870
#define CLC1SEL3_D4S4                 2871
#define LC1D4S5                       2872
#define CLC1SEL3_D4S5                 2873
#define LC1D4S6                       2874
#define CLC1SEL3_D4S6                 2875
#define LC1D4S7                       2876
#define CLC1SEL3_D4S7                 2877
#define CLC1GLS0                      2878
#define CLC1GLS0_D1N                  2879
#define LC1G1D1N                      2880
#define CLC1GLS0_D1T                  2881
#define LC1G1D1T                      2882
#define LC1G1D2N                      2883
#define CLC1GLS0_D2N                  2884
#define LC1G1D2T                      2885
#define CLC1GLS0_D2T                  2886
#define CLC1GLS0_D3N                  2887
#define LC1G1D3N                      2888
#define CLC1GLS0_D3T                  2889
#define LC1G1D3T                      2890
#define CLC1GLS0_D4N                  2891
#define LC1G1D4N                      2892
#define CLC1GLS0_D4T                  2893
#define LC1G1D4T                      2894
#define CLC1GLS1                      2895
#define CLC1GLS1_D1N                  2896
#define LC1G2D1N                      2897
#define LC1G2D1T                      2898
#define CLC1GLS1_D1T                  2899
#define CLC1GLS1_D2N                  2900
#define LC1G2D2N                      2901
#define LC1G2D2T                      2902
#define CLC1GLS1_D2T                  2903
#define CLC1GLS1_D3N                  2904
#define LC1G2D3N                      2905
#define LC1G2D3T                      2906
#define CLC1GLS1_D3T                  2907
#define CLC1GLS1_D4N                  2908
#define LC1G2D4N                      2909
#define LC1G2D4T                      2910
#define CLC1GLS1_D4T                  2911
#define CLC1GLS2                      2912
#define CLC1GLS2_D1N                  2913
#define LC1G3D1N                      2914
#define LC1G3D1T                      2915
#define CLC1GLS2_D1T                  2916
#define LC1G3D2N                      2917
#define CLC1GLS2_D2N                  2918
#define LC1G3D2T                      2919
#define CLC1GLS2_D2T                  2920
#define CLC1GLS2_D3N                  2921
#define LC1G3D3N                      2922
#define LC1G3D3T                      2923
#define CLC1GLS2_D3T                  2924
#define LC1G3D4N                      2925
#define CLC1GLS2_D4N                  2926
#define LC1G3D4T                      2927
#define CLC1GLS2_D4T                  2928
#define CLC1GLS3                      2929
#define LC1G4D1N                      2930
#define CLC1GLS3_G4D1N                2931
#define LC1G4D1T                      2932
#define CLC1GLS3_G4D1T                2933
#define CLC1GLS3_G4D2N                2934
#define LC1G4D2N                      2935
#define CLC1GLS3_G4D2T                2936
#define LC1G4D2T                      2937
#define LC1G4D3N                      2938
#define CLC1GLS3_G4D3N                2939
#define LC1G4D3T                      2940
#define CLC1GLS3_G4D3T                2941
#define CLC1GLS3_G4D4N                2942
#define LC1G4D4N                      2943
#define CLC1GLS3_G4D4T                2944
#define LC1G4D4T                      2945
#define CLC2CON                       2946
#define LC2MODE0                      2947
#define CLC2CON_MODE                  2948
#define LC2MODE                       2949
#define CLC2CON_MODE0                 2950
#define LC2MODE1                      2951
#define CLC2CON_MODE1                 2952
#define LC2MODE2                      2953
#define CLC2CON_MODE2                 2954
#define LC2INTN                       2955
#define CLC2CON_INTN                  2956
#define LC2INTP                       2957
#define CLC2CON_INTP                  2958
#define CLC2CON_OUT                   2959
#define LC2OUT                        2960
#define CLC2CON_EN                    2961
#define LC2EN                         2962
#define CLC2POL                       2963
#define LC2G1POL                      2964
#define CLC2POL_G1POL                 2965
#define LC2G2POL                      2966
#define CLC2POL_G2POL                 2967
#define LC2G3POL                      2968
#define CLC2POL_G3POL                 2969
#define LC2G4POL                      2970
#define CLC2POL_G4POL                 2971
#define CLC2POL_POL                   2972
#define LC2POL                        2973
#define CLC2SEL0                      2974
#define CLC2SEL0_D1S                  2975
#define LC2D1S                        2976
#define LC2D1S0                       2977
#define CLC2SEL0_D1S0                 2978
#define LC2D1S1                       2979
#define CLC2SEL0_D1S1                 2980
#define LC2D1S2                       2981
#define CLC2SEL0_D1S2                 2982
#define LC2D1S3                       2983
#define CLC2SEL0_D1S3                 2984
#define LC2D1S4                       2985
#define CLC2SEL0_D1S4                 2986
#define LC2D1S5                       2987
#define CLC2SEL0_D1S5                 2988
#define LC2D1S6                       2989
#define CLC2SEL0_D1S6                 2990
#define LC2D1S7                       2991
#define CLC2SEL0_D1S7                 2992
#define CLC2SEL1                      2993
#define LC2D2S0                       2994
#define LC2D2S                        2995
#define CLC2SEL1_D2S                  2996
#define CLC2SEL1_D2S0                 2997
#define LC2D2S1                       2998
#define CLC2SEL1_D2S1                 2999
#define LC2D2S2                       3000
#define CLC2SEL1_D2S2                 3001
#define LC2D2S3                       3002
#define CLC2SEL1_D2S3                 3003
#define LC2D2S4                       3004
#define CLC2SEL1_D2S4                 3005
#define LC2D2S5                       3006
#define CLC2SEL1_D2S5                 3007
#define LC2D2S6                       3008
#define CLC2SEL1_D2S6                 3009
#define LC2D2S7                       3010
#define CLC2SEL1_D2S7                 3011
#define CLC2SEL2                      3012
#define CLC2SEL2_D3S0                 3013
#define LC2D3S                        3014
#define CLC2SEL2_D3S                  3015
#define LC2D3S0                       3016
#define CLC2SEL2_D3S1                 3017
#define LC2D3S1                       3018
#define CLC2SEL2_D3S2                 3019
#define LC2D3S2                       3020
#define CLC2SEL2_D3S3                 3021
#define LC2D3S3                       3022
#define CLC2SEL2_D3S4                 3023
#define LC2D3S4                       3024
#define CLC2SEL2_D3S5                 3025
#define LC2D3S5                       3026
#define CLC2SEL2_D3S6                 3027
#define LC2D3S6                       3028
#define CLC2SEL2_D3S7                 3029
#define LC2D3S7                       3030
#define CLC2SEL3                      3031
#define LC2D4S                        3032
#define CLC2SEL3_D4S0                 3033
#define LC2D4S0                       3034
#define CLC2SEL3_D4S                  3035
#define CLC2SEL3_D4S1                 3036
#define LC2D4S1                       3037
#define CLC2SEL3_D4S2                 3038
#define LC2D4S2                       3039
#define CLC2SEL3_D4S3                 3040
#define LC2D4S3                       3041
#define CLC2SEL3_D4S4                 3042
#define LC2D4S4                       3043
#define CLC2SEL3_D4S5                 3044
#define LC2D4S5                       3045
#define CLC2SEL3_D4S6                 3046
#define LC2D4S6                       3047
#define CLC2SEL3_D4S7                 3048
#define LC2D4S7                       3049
#define CLC2GLS0                      3050
#define LC2G1D1N                      3051
#define CLC2GLS0_D1N                  3052
#define CLC2GLS0_D1T                  3053
#define LC2G1D1T                      3054
#define LC2G1D2N                      3055
#define CLC2GLS0_D2N                  3056
#define CLC2GLS0_D2T                  3057
#define LC2G1D2T                      3058
#define LC2G1D3N                      3059
#define CLC2GLS0_D3N                  3060
#define CLC2GLS0_D3T                  3061
#define LC2G1D3T                      3062
#define LC2G1D4N                      3063
#define CLC2GLS0_D4N                  3064
#define CLC2GLS0_D4T                  3065
#define LC2G1D4T                      3066
#define CLC2GLS1                      3067
#define CLC2GLS1_D1N                  3068
#define LC2G2D1N                      3069
#define CLC2GLS1_D1T                  3070
#define LC2G2D1T                      3071
#define CLC2GLS1_D2N                  3072
#define LC2G2D2N                      3073
#define CLC2GLS1_D2T                  3074
#define LC2G2D2T                      3075
#define LC2G2D3N                      3076
#define CLC2GLS1_D3N                  3077
#define LC2G2D3T                      3078
#define CLC2GLS1_D3T                  3079
#define LC2G2D4N                      3080
#define CLC2GLS1_D4N                  3081
#define LC2G2D4T                      3082
#define CLC2GLS1_D4T                  3083
#define CLC2GLS2                      3084
#define LC2G3D1N                      3085
#define CLC2GLS2_D1N                  3086
#define CLC2GLS2_D1T                  3087
#define LC2G3D1T                      3088
#define CLC2GLS2_D2N                  3089
#define LC2G3D2N                      3090
#define LC2G3D2T                      3091
#define CLC2GLS2_D2T                  3092
#define CLC2GLS2_D3N                  3093
#define LC2G3D3N                      3094
#define CLC2GLS2_D3T                  3095
#define LC2G3D3T                      3096
#define CLC2GLS2_D4N                  3097
#define LC2G3D4N                      3098
#define LC2G3D4T                      3099
#define CLC2GLS2_D4T                  3100
#define CLC2GLS3                      3101
#define LC2G4D1N                      3102
#define CLC2GLS3_G4D1N                3103
#define CLC2GLS3_G4D1T                3104
#define LC2G4D1T                      3105
#define CLC2GLS3_G4D2N                3106
#define LC2G4D2N                      3107
#define LC2G4D2T                      3108
#define CLC2GLS3_G4D2T                3109
#define CLC2GLS3_G4D3N                3110
#define LC2G4D3N                      3111
#define CLC2GLS3_G4D3T                3112
#define LC2G4D3T                      3113
#define LC2G4D4N                      3114
#define CLC2GLS3_G4D4N                3115
#define CLC2GLS3_G4D4T                3116
#define LC2G4D4T                      3117
#define CLC3CON                       3118
#define LC3MODE                       3119
#define CLC3CON_MODE0                 3120
#define LC3MODE0                      3121
#define CLC3CON_MODE                  3122
#define CLC3CON_MODE1                 3123
#define LC3MODE1                      3124
#define CLC3CON_MODE2                 3125
#define LC3MODE2                      3126
#define LC3INTN                       3127
#define CLC3CON_INTN                  3128
#define LC3INTP                       3129
#define CLC3CON_INTP                  3130
#define LC3OUT                        3131
#define CLC3CON_OUT                   3132
#define LC3EN                         3133
#define CLC3CON_EN                    3134
#define CLC3POL                       3135
#define LC3G1POL                      3136
#define CLC3POL_G1POL                 3137
#define LC3G2POL                      3138
#define CLC3POL_G2POL                 3139
#define CLC3POL_G3POL                 3140
#define LC3G3POL                      3141
#define LC3G4POL                      3142
#define CLC3POL_G4POL                 3143
#define LC3POL                        3144
#define CLC3POL_POL                   3145
#define CLC3SEL0                      3146
#define LC3D1S                        3147
#define CLC3SEL0_D1S                  3148
#define LC3D1S0                       3149
#define CLC3SEL0_D1S0                 3150
#define LC3D1S1                       3151
#define CLC3SEL0_D1S1                 3152
#define LC3D1S2                       3153
#define CLC3SEL0_D1S2                 3154
#define LC3D1S3                       3155
#define CLC3SEL0_D1S3                 3156
#define LC3D1S4                       3157
#define CLC3SEL0_D1S4                 3158
#define LC3D1S5                       3159
#define CLC3SEL0_D1S5                 3160
#define LC3D1S6                       3161
#define CLC3SEL0_D1S6                 3162
#define LC3D1S7                       3163
#define CLC3SEL0_D1S7                 3164
#define CLC3SEL1                      3165
#define LC3D2S0                       3166
#define LC3D2S                        3167
#define CLC3SEL1_D2S0                 3168
#define CLC3SEL1_D2S                  3169
#define LC3D2S1                       3170
#define CLC3SEL1_D2S1                 3171
#define LC3D2S2                       3172
#define CLC3SEL1_D2S2                 3173
#define LC3D2S3                       3174
#define CLC3SEL1_D2S3                 3175
#define LC3D2S4                       3176
#define CLC3SEL1_D2S4                 3177
#define LC3D2S5                       3178
#define CLC3SEL1_D2S5                 3179
#define LC3D2S6                       3180
#define CLC3SEL1_D2S6                 3181
#define LC3D2S7                       3182
#define CLC3SEL1_D2S7                 3183
#define CLC3SEL2                      3184
#define LC3D3S                        3185
#define CLC3SEL2_D3S                  3186
#define LC3D3S0                       3187
#define CLC3SEL2_D3S0                 3188
#define LC3D3S1                       3189
#define CLC3SEL2_D3S1                 3190
#define LC3D3S2                       3191
#define CLC3SEL2_D3S2                 3192
#define LC3D3S3                       3193
#define CLC3SEL2_D3S3                 3194
#define LC3D3S4                       3195
#define CLC3SEL2_D3S4                 3196
#define LC3D3S5                       3197
#define CLC3SEL2_D3S5                 3198
#define LC3D3S6                       3199
#define CLC3SEL2_D3S6                 3200
#define LC3D3S7                       3201
#define CLC3SEL2_D3S7                 3202
#define CLC3SEL3                      3203
#define CLC3SEL3_D4S                  3204
#define LC3D4S0                       3205
#define LC3D4S                        3206
#define CLC3SEL3_D4S0                 3207
#define LC3D4S1                       3208
#define CLC3SEL3_D4S1                 3209
#define LC3D4S2                       3210
#define CLC3SEL3_D4S2                 3211
#define LC3D4S3                       3212
#define CLC3SEL3_D4S3                 3213
#define LC3D4S4                       3214
#define CLC3SEL3_D4S4                 3215
#define LC3D4S5                       3216
#define CLC3SEL3_D4S5                 3217
#define LC3D4S6                       3218
#define CLC3SEL3_D4S6                 3219
#define LC3D4S7                       3220
#define CLC3SEL3_D4S7                 3221
#define CLC3GLS0                      3222
#define CLC3GLS0_D1N                  3223
#define LC3G1D1N                      3224
#define LC3G1D1T                      3225
#define CLC3GLS0_D1T                  3226
#define LC3G1D2N                      3227
#define CLC3GLS0_D2N                  3228
#define CLC3GLS0_D2T                  3229
#define LC3G1D2T                      3230
#define CLC3GLS0_D3N                  3231
#define LC3G1D3N                      3232
#define LC3G1D3T                      3233
#define CLC3GLS0_D3T                  3234
#define CLC3GLS0_D4N                  3235
#define LC3G1D4N                      3236
#define CLC3GLS0_D4T                  3237
#define LC3G1D4T                      3238
#define CLC3GLS1                      3239
#define LC3G2D1N                      3240
#define CLC3GLS1_D1N                  3241
#define CLC3GLS1_D1T                  3242
#define LC3G2D1T                      3243
#define LC3G2D2N                      3244
#define CLC3GLS1_D2N                  3245
#define LC3G2D2T                      3246
#define CLC3GLS1_D2T                  3247
#define LC3G2D3N                      3248
#define CLC3GLS1_D3N                  3249
#define CLC3GLS1_D3T                  3250
#define LC3G2D3T                      3251
#define LC3G2D4N                      3252
#define CLC3GLS1_D4N                  3253
#define LC3G2D4T                      3254
#define CLC3GLS1_D4T                  3255
#define CLC3GLS2                      3256
#define LC3G3D1N                      3257
#define CLC3GLS2_D1N                  3258
#define LC3G3D1T                      3259
#define CLC3GLS2_D1T                  3260
#define CLC3GLS2_D2N                  3261
#define LC3G3D2N                      3262
#define CLC3GLS2_D2T                  3263
#define LC3G3D2T                      3264
#define CLC3GLS2_D3N                  3265
#define LC3G3D3N                      3266
#define LC3G3D3T                      3267
#define CLC3GLS2_D3T                  3268
#define CLC3GLS2_D4N                  3269
#define LC3G3D4N                      3270
#define CLC3GLS2_D4T                  3271
#define LC3G3D4T                      3272
#define CLC3GLS3                      3273
#define LC3G4D1N                      3274
#define CLC3GLS3_G4D1N                3275
#define LC3G4D1T                      3276
#define CLC3GLS3_G4D1T                3277
#define LC3G4D2N                      3278
#define CLC3GLS3_G4D2N                3279
#define CLC3GLS3_G4D2T                3280
#define LC3G4D2T                      3281
#define LC3G4D3N                      3282
#define CLC3GLS3_G4D3N                3283
#define CLC3GLS3_G4D3T                3284
#define LC3G4D3T                      3285
#define LC3G4D4N                      3286
#define CLC3GLS3_G4D4N                3287
#define LC3G4D4T                      3288
#define CLC3GLS3_G4D4T                3289
#define CLC4CON                       3290
#define LC4MODE                       3291
#define CLC4CON_MODE                  3292
#define LC4MODE0                      3293
#define CLC4CON_MODE0                 3294
#define LC4MODE1                      3295
#define CLC4CON_MODE1                 3296
#define LC4MODE2                      3297
#define CLC4CON_MODE2                 3298
#define LC4INTN                       3299
#define CLC4CON_INTN                  3300
#define CLC4CON_INTP                  3301
#define LC4INTP                       3302
#define CLC4CON_OUT                   3303
#define LC4OUT                        3304
#define CLC4CON_EN                    3305
#define LC4EN                         3306
#define CLC4POL                       3307
#define CLC4POL_G1POL                 3308
#define LC4G1POL                      3309
#define CLC4POL_G2POL                 3310
#define LC4G2POL                      3311
#define CLC4POL_G3POL                 3312
#define LC4G3POL                      3313
#define LC4G4POL                      3314
#define CLC4POL_G4POL                 3315
#define LC4POL                        3316
#define CLC4POL_POL                   3317
#define CLC4SEL0                      3318
#define LC4D1S0                       3319
#define CLC4SEL0_D1S                  3320
#define CLC4SEL0_D1S0                 3321
#define LC4D1S                        3322
