tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18857_tdd.h
#define LC4D1S1                       3323
#define CLC4SEL0_D1S1                 3324
#define LC4D1S2                       3325
#define CLC4SEL0_D1S2                 3326
#define LC4D1S3                       3327
#define CLC4SEL0_D1S3                 3328
#define LC4D1S4                       3329
#define CLC4SEL0_D1S4                 3330
#define LC4D1S5                       3331
#define CLC4SEL0_D1S5                 3332
#define LC4D1S6                       3333
#define CLC4SEL0_D1S6                 3334
#define LC4D1S7                       3335
#define CLC4SEL0_D1S7                 3336
#define CLC4SEL1                      3337
#define CLC4SEL1_D2S                  3338
#define CLC4SEL1_D2S0                 3339
#define LC4D2S                        3340
#define LC4D2S0                       3341
#define CLC4SEL1_D2S1                 3342
#define LC4D2S1                       3343
#define CLC4SEL1_D2S2                 3344
#define LC4D2S2                       3345
#define CLC4SEL1_D2S3                 3346
#define LC4D2S3                       3347
#define CLC4SEL1_D2S4                 3348
#define LC4D2S4                       3349
#define CLC4SEL1_D2S5                 3350
#define LC4D2S5                       3351
#define CLC4SEL1_D2S6                 3352
#define LC4D2S6                       3353
#define CLC4SEL1_D2S7                 3354
#define LC4D2S7                       3355
#define CLC4SEL2                      3356
#define CLC4SEL2_D3S                  3357
#define LC4D3S0                       3358
#define LC4D3S                        3359
#define CLC4SEL2_D3S0                 3360
#define LC4D3S1                       3361
#define CLC4SEL2_D3S1                 3362
#define LC4D3S2                       3363
#define CLC4SEL2_D3S2                 3364
#define LC4D3S3                       3365
#define CLC4SEL2_D3S3                 3366
#define LC4D3S4                       3367
#define CLC4SEL2_D3S4                 3368
#define LC4D3S5                       3369
#define CLC4SEL2_D3S5                 3370
#define LC4D3S6                       3371
#define CLC4SEL2_D3S6                 3372
#define LC4D3S7                       3373
#define CLC4SEL2_D3S7                 3374
#define CLC4SEL3                      3375
#define CLC4SEL3_D4S                  3376
#define LC4D4S0                       3377
#define CLC4SEL3_D4S0                 3378
#define LC4D4S                        3379
#define LC4D4S1                       3380
#define CLC4SEL3_D4S1                 3381
#define LC4D4S2                       3382
#define CLC4SEL3_D4S2                 3383
#define LC4D4S3                       3384
#define CLC4SEL3_D4S3                 3385
#define LC4D4S4                       3386
#define CLC4SEL3_D4S4                 3387
#define LC4D4S5                       3388
#define CLC4SEL3_D4S5                 3389
#define LC4D4S6                       3390
#define CLC4SEL3_D4S6                 3391
#define LC4D4S7                       3392
#define CLC4SEL3_D4S7                 3393
#define CLC4GLS0                      3394
#define CLC4GLS0_D1N                  3395
#define LC4G1D1N                      3396
#define CLC4GLS0_D1T                  3397
#define LC4G1D1T                      3398
#define CLC4GLS0_D2N                  3399
#define LC4G1D2N                      3400
#define CLC4GLS0_D2T                  3401
#define LC4G1D2T                      3402
#define CLC4GLS0_D3N                  3403
#define LC4G1D3N                      3404
#define CLC4GLS0_D3T                  3405
#define LC4G1D3T                      3406
#define CLC4GLS0_D4N                  3407
#define LC4G1D4N                      3408
#define CLC4GLS0_D4T                  3409
#define LC4G1D4T                      3410
#define CLC4GLS1                      3411
#define CLC4GLS1_D1N                  3412
#define LC4G2D1N                      3413
#define CLC4GLS1_D1T                  3414
#define LC4G2D1T                      3415
#define LC4G2D2N                      3416
#define CLC4GLS1_D2N                  3417
#define LC4G2D2T                      3418
#define CLC4GLS1_D2T                  3419
#define CLC4GLS1_D3N                  3420
#define LC4G2D3N                      3421
#define LC4G2D3T                      3422
#define CLC4GLS1_D3T                  3423
#define CLC4GLS1_D4N                  3424
#define LC4G2D4N                      3425
#define CLC4GLS1_D4T                  3426
#define LC4G2D4T                      3427
#define CLC4GLS2                      3428
#define CLC4GLS2_D1N                  3429
#define LC4G3D1N                      3430
#define CLC4GLS2_D1T                  3431
#define LC4G3D1T                      3432
#define LC4G3D2N                      3433
#define CLC4GLS2_D2N                  3434
#define LC4G3D2T                      3435
#define CLC4GLS2_D2T                  3436
#define CLC4GLS2_D3N                  3437
#define LC4G3D3N                      3438
#define CLC4GLS2_D3T                  3439
#define LC4G3D3T                      3440
#define LC4G3D4N                      3441
#define CLC4GLS2_D4N                  3442
#define LC4G3D4T                      3443
#define CLC4GLS2_D4T                  3444
#define CLC4GLS3                      3445
#define CLC4GLS3_G4D1N                3446
#define LC4G4D1N                      3447
#define LC4G4D1T                      3448
#define CLC4GLS3_G4D1T                3449
#define LC4G4D2N                      3450
#define CLC4GLS3_G4D2N                3451
#define LC4G4D2T                      3452
#define CLC4GLS3_G4D2T                3453
#define CLC4GLS3_G4D3N                3454
#define LC4G4D3N                      3455
#define CLC4GLS3_G4D3T                3456
#define LC4G4D3T                      3457
#define LC4G4D4N                      3458
#define CLC4GLS3_G4D4N                3459
#define LC4G4D4T                      3460
#define CLC4GLS3_G4D4T                3461
#define PPSLOCK                       3462
#define PPSLOCKED                     3463
#define INTPPS0                       3464
#define INTPPS                        3465
#define INTPPS1                       3466
#define INTPPS2                       3467
#define INTPPS3                       3468
#define T0CKIPPS                      3469
#define T0CKIPPS0                     3470
#define T0CKIPPS1                     3471
#define T0CKIPPS2                     3472
#define T0CKIPPS3                     3473
#define T1CKIPPS0                     3474
#define T1CKIPPS                      3475
#define T1CKIPPS1                     3476
#define T1CKIPPS2                     3477
#define T1CKIPPS3                     3478
#define T1CKIPPS4                     3479
#define T1GPPS0                       3480
#define T1GPPS                        3481
#define T1GPPS1                       3482
#define T1GPPS2                       3483
#define T1GPPS3                       3484
#define T1GPPS4                       3485
#define T3CKIPPS0                     3486
#define T3CKIPPS                      3487
#define T3CKIPPS1                     3488
#define T3CKIPPS2                     3489
#define T3CKIPPS3                     3490
#define T3CKIPPS4                     3491
#define T3GPPS0                       3492
#define T3GPPS                        3493
#define T3GPPS1                       3494
#define T3GPPS2                       3495
#define T3GPPS3                       3496
#define T3GPPS4                       3497
#define T5CKIPPS0                     3498
#define T5CKIPPS                      3499
#define T5CKIPPS1                     3500
#define T5CKIPPS2                     3501
#define T5CKIPPS3                     3502
#define T5CKIPPS4                     3503
#define T5GPPS                        3504
#define T5GPPS0                       3505
#define T5GPPS1                       3506
#define T5GPPS2                       3507
#define T5GPPS3                       3508
#define T5GPPS4                       3509
#define T2AINPPS                      3510
#define T2AINPPS0                     3511
#define T2AINPPS1                     3512
#define T2AINPPS2                     3513
#define T2AINPPS3                     3514
#define T2AINPPS4                     3515
#define T4AINPPS                      3516
#define T4AINPPS0                     3517
#define T4AINPPS1                     3518
#define T4AINPPS2                     3519
#define T4AINPPS3                     3520
#define T4AINPPS4                     3521
#define T6AINPPS0                     3522
#define T6AINPPS                      3523
#define T6AINPPS1                     3524
#define T6AINPPS2                     3525
#define T6AINPPS3                     3526
#define T6AINPPS4                     3527
#define CCP1PPS0                      3528
#define CCP1PPS                       3529
#define CCP1PPS1                      3530
#define CCP1PPS2                      3531
#define CCP1PPS3                      3532
#define CCP1PPS4                      3533
#define CCP2PPS0                      3534
#define CCP2PPS                       3535
#define CCP2PPS1                      3536
#define CCP2PPS2                      3537
#define CCP2PPS3                      3538
#define CCP2PPS4                      3539
#define CCP3PPS0                      3540
#define CCP3PPS                       3541
#define CCP3PPS1                      3542
#define CCP3PPS2                      3543
#define CCP3PPS3                      3544
#define CCP3PPS4                      3545
#define CCP4PPS0                      3546
#define CCP4PPS                       3547
#define CCP4PPS1                      3548
#define CCP4PPS2                      3549
#define CCP4PPS3                      3550
#define CCP4PPS4                      3551
#define CCP5PPS                       3552
#define CCP5PPS0                      3553
#define CCP5PPS1                      3554
#define CCP5PPS2                      3555
#define CCP5PPS3                      3556
#define CCP5PPS4                      3557
#define CCP6PPS                       3558
#define SMT1WINPPS                    3559
#define SMU1WINPPS0                   3560
#define SMU1WINPPS1                   3561
#define SMU1WINPPS2                   3562
#define SMU1WINPPS3                   3563
#define SMU1WINPPS4                   3564
#define SMT1SIGPPS                    3565
#define SMU1SIGPPS0                   3566
#define SMU1SIGPPS1                   3567
#define SMU1SIGPPS2                   3568
#define SMU1SIGPPS3                   3569
#define SMU1SIGPPS4                   3570
#define SMT2WINPPS                    3571
#define SMU2WINPPS0                   3572
#define SMU2WINPPS1                   3573
#define SMU2WINPPS2                   3574
#define SMU2WINPPS3                   3575
#define SMU2WINPPS4                   3576
#define SMT2SIGPPS                    3577
#define SMU2SIGPPS0                   3578
#define SMU2SIGPPS1                   3579
#define SMU2SIGPPS2                   3580
#define SMU2SIGPPS3                   3581
#define SMU2SIGPPS4                   3582
#define CWG1PPS0                      3583
#define CWG1PPS                       3584
#define CWG1PPS1                      3585
#define CWG1PPS2                      3586
#define CWG1PPS3                      3587
#define CWG1PPS4                      3588
#define CWG2PPS0                      3589
#define CWG2PPS                       3590
#define CWG2PPS1                      3591
#define CWG2PPS2                      3592
#define CWG2PPS3                      3593
#define CWG2PPS4                      3594
#define CWG3PPS0                      3595
#define CWG3PPS                       3596
#define CWG3PPS1                      3597
#define CWG3PPS2                      3598
#define CWG3PPS3                      3599
#define CWG3PPS4                      3600
#define MDCARLPPS                     3601
#define MDCARLPPS0                    3602
#define MDCARLPPS1                    3603
#define MDCARLPPS2                    3604
#define MDCARLPPS3                    3605
#define MDCARLPPS4                    3606
#define MDCARHPPS0                    3607
#define MDCARHPPS                     3608
#define MDCARHPPS1                    3609
#define MDCARHPPS2                    3610
#define MDCARHPPS3                    3611
#define MDCARHPPS4                    3612
#define MDSRCPPS0                     3613
#define MDSRCPPS                      3614
#define MDSRCPPS1                     3615
#define MDSRCPPS2                     3616
#define MDSRCPPS3                     3617
#define MDSRCPPS4                     3618
#define CLCIN0PPS                     3619
#define CLCIN0PPS0                    3620
#define CLCIN0PPS1                    3621
#define CLCIN0PPS2                    3622
#define CLCIN0PPS3                    3623
#define CLCIN0PPS4                    3624
#define CLCIN1PPS                     3625
#define CLCIN1PPS0                    3626
#define CLCIN1PPS1                    3627
#define CLCIN1PPS2                    3628
#define CLCIN1PPS3                    3629
#define CLCIN1PPS4                    3630
#define CLCIN2PPS                     3631
#define CLCIN2PPS0                    3632
#define CLCIN2PPS1                    3633
#define CLCIN2PPS2                    3634
#define CLCIN2PPS3                    3635
#define CLCIN2PPS4                    3636
#define CLCIN3PPS                     3637
#define CLCIN3PPS0                    3638
#define CLCIN3PPS1                    3639
#define CLCIN3PPS2                    3640
#define CLCIN3PPS3                    3641
#define CLCIN3PPS4                    3642
#define ADCACTPPS                     3643
#define ADCACTPPS0                    3644
#define ADCACTPPS1                    3645
#define ADCACTPPS2                    3646
#define ADCACTPPS3                    3647
#define ADCACTPPS4                    3648
#define SSP1CLKPPS                    3649
#define SSP1CLKPPS0                   3650
#define SSP1CLKPPS1                   3651
#define SSP1CLKPPS2                   3652
#define SSP1CLKPPS3                   3653
#define SSP1CLKPPS4                   3654
#define SSP1DATPPS                    3655
#define SSP1DATPPS0                   3656
#define SSP1DATPPS1                   3657
#define SSP1DATPPS2                   3658
#define SSP1DATPPS3                   3659
#define SSP1DATPPS4                   3660
#define SSP1SSPPS                     3661
#define SSP1SSPPS0                    3662
#define SSP1SSPPS1                    3663
#define SSP1SSPPS2                    3664
#define SSP1SSPPS3                    3665
#define SSP1SSPPS4                    3666
#define SSP2CLKPPS                    3667
#define SSP2CLKPPS0                   3668
#define SSP2CLKPPS1                   3669
#define SSP2CLKPPS2                   3670
#define SSP2CLKPPS3                   3671
#define SSP2CLKPPS4                   3672
#define SSP2DATPPS                    3673
#define SSP2DATPPS0                   3674
#define SSP2DATPPS1                   3675
#define SSP2DATPPS2                   3676
#define SSP2DATPPS3                   3677
#define SSP2DATPPS4                   3678
#define SSP2SSPPS                     3679
#define SSP2SSPPS0                    3680
#define SSP2SSPPS1                    3681
#define SSP2SSPPS2                    3682
#define SSP2SSPPS3                    3683
#define SSP2SSPPS4                    3684
#define RXPPS                         3685
#define RXPPS0                        3686
#define RXPPS1                        3687
#define RXPPS2                        3688
#define RXPPS3                        3689
#define RXPPS4                        3690
#define TXPPS                         3691
#define TXPPS0                        3692
#define TXPPS1                        3693
#define TXPPS2                        3694
#define TXPPS3                        3695
#define TXPPS4                        3696
#define RA0PPS                        3697
#define RA0PPS0                       3698
#define RA0PPS1                       3699
#define RA0PPS2                       3700
#define RA0PPS3                       3701
#define RA0PPS4                       3702
#define RA0PPS5                       3703
#define RA1PPS                        3704
#define RA1PPS0                       3705
#define RA1PPS1                       3706
#define RA1PPS2                       3707
#define RA1PPS3                       3708
#define RA1PPS4                       3709
#define RA1PPS5                       3710
#define RA2PPS                        3711
#define RA2PPS0                       3712
#define RA2PPS1                       3713
#define RA2PPS2                       3714
#define RA2PPS3                       3715
#define RA2PPS4                       3716
#define RA2PPS5                       3717
#define RA3PPS                        3718
#define RA3PPS0                       3719
#define RA3PPS1                       3720
#define RA3PPS2                       3721
#define RA3PPS3                       3722
#define RA3PPS4                       3723
#define RA3PPS5                       3724
#define RA4PPS                        3725
#define RA4PPS0                       3726
#define RA4PPS1                       3727
#define RA4PPS2                       3728
#define RA4PPS3                       3729
#define RA4PPS4                       3730
#define RA4PPS5                       3731
#define RA5PPS                        3732
#define RA5PPS0                       3733
#define RA5PPS1                       3734
#define RA5PPS2                       3735
#define RA5PPS3                       3736
#define RA5PPS4                       3737
#define RA5PPS5                       3738
#define RA6PPS                        3739
#define RA6PPS0                       3740
#define RA6PPS1                       3741
#define RA6PPS2                       3742
#define RA6PPS3                       3743
#define RA6PPS4                       3744
#define RA6PPS5                       3745
#define RA7PPS                        3746
#define RA7PPS0                       3747
#define RA7PPS1                       3748
#define RA7PPS2                       3749
#define RA7PPS3                       3750
#define RA7PPS4                       3751
#define RA7PPS5                       3752
#define RB0PPS                        3753
#define RB0PPS0                       3754
#define RB0PPS1                       3755
#define RB0PPS2                       3756
#define RB0PPS3                       3757
#define RB0PPS4                       3758
#define RB0PPS5                       3759
#define RB1PPS                        3760
#define RB1PPS0                       3761
#define RB1PPS1                       3762
#define RB1PPS2                       3763
#define RB1PPS3                       3764
#define RB1PPS4                       3765
#define RB1PPS5                       3766
#define RB2PPS                        3767
#define RB2PPS0                       3768
#define RB2PPS1                       3769
#define RB2PPS2                       3770
#define RB2PPS3                       3771
#define RB2PPS4                       3772
#define RB2PPS5                       3773
#define RB3PPS                        3774
#define RB3PPS0                       3775
#define RB3PPS1                       3776
#define RB3PPS2                       3777
#define RB3PPS3                       3778
#define RB3PPS4                       3779
#define RB3PPS5                       3780
#define RB4PPS                        3781
#define RB4PPS0                       3782
#define RB4PPS1                       3783
#define RB4PPS2                       3784
#define RB4PPS3                       3785
#define RB4PPS4                       3786
#define RB4PPS5                       3787
#define RB5PPS                        3788
#define RB5PPS0                       3789
#define RB5PPS1                       3790
#define RB5PPS2                       3791
#define RB5PPS3                       3792
#define RB5PPS4                       3793
#define RB5PPS5                       3794
#define RB6PPS                        3795
#define RB6PPS0                       3796
#define RB6PPS1                       3797
#define RB6PPS2                       3798
#define RB6PPS3                       3799
#define RB6PPS4                       3800
#define RB6PPS5                       3801
#define RB7PPS                        3802
#define RB7PPS0                       3803
#define RB7PPS1                       3804
#define RB7PPS2                       3805
#define RB7PPS3                       3806
#define RB7PPS4                       3807
#define RB7PPS5                       3808
#define RC0PPS                        3809
#define RC0PPS0                       3810
#define RC0PPS1                       3811
#define RC0PPS2                       3812
#define RC0PPS3                       3813
#define RC0PPS4                       3814
#define RC0PPS5                       3815
#define RC1PPS                        3816
#define RC1PPS0                       3817
#define RC1PPS1                       3818
#define RC1PPS2                       3819
#define RC1PPS3                       3820
#define RC1PPS4                       3821
#define RC1PPS5                       3822
#define RC2PPS                        3823
#define RC2PPS0                       3824
#define RC2PPS1                       3825
#define RC2PPS2                       3826
#define RC2PPS3                       3827
#define RC2PPS4                       3828
#define RC2PPS5                       3829
#define RC3PPS                        3830
#define RC3PPS0                       3831
#define RC3PPS1                       3832
#define RC3PPS2                       3833
#define RC3PPS3                       3834
#define RC3PPS4                       3835
#define RC3PPS5                       3836
#define RC4PPS                        3837
#define RC4PPS0                       3838
#define RC4PPS1                       3839
#define RC4PPS2                       3840
#define RC4PPS3                       3841
#define RC4PPS4                       3842
#define RC4PPS5                       3843
#define RC5PPS                        3844
#define RC5PPS0                       3845
#define RC5PPS1                       3846
#define RC5PPS2                       3847
#define RC5PPS3                       3848
#define RC5PPS4                       3849
#define RC5PPS5                       3850
#define RC6PPS                        3851
#define RC6PPS0                       3852
#define RC6PPS1                       3853
#define RC6PPS2                       3854
#define RC6PPS3                       3855
#define RC6PPS4                       3856
#define RC6PPS5                       3857
#define RC7PPS                        3858
#define RC7PPS0                       3859
#define RC7PPS1                       3860
#define RC7PPS2                       3861
#define RC7PPS3                       3862
#define RC7PPS4                       3863
#define RC7PPS5                       3864
#define ANSELA                        3865
#define ANSA0                         3866
#define ANSA1                         3867
#define ANSA2                         3868
#define ANSA3                         3869
#define ANSA4                         3870
#define ANSA5                         3871
#define ANSA6                         3872
#define ANSA7                         3873
#define WPUA                          3874
#define WPUA0                         3875
#define WPUA1                         3876
#define WPUA2                         3877
#define WPUA3                         3878
#define WPUA4                         3879
#define WPUA5                         3880
