tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18857_tdd.h
#define WPUA6                         3881
#define WPUA7                         3882
#define ODCONA                        3883
#define ODCA0                         3884
#define ODCA1                         3885
#define ODCA2                         3886
#define ODCA3                         3887
#define ODCA4                         3888
#define ODCA5                         3889
#define ODCA6                         3890
#define ODCA7                         3891
#define SLRCONA                       3892
#define SLRA0                         3893
#define SLRA1                         3894
#define SLRA2                         3895
#define SLRA3                         3896
#define SLRA4                         3897
#define SLRA5                         3898
#define SLRA6                         3899
#define SLRA7                         3900
#define INLVLA                        3901
#define INLVLA0                       3902
#define INLVLA1                       3903
#define INLVLA2                       3904
#define INLVLA3                       3905
#define INLVLA4                       3906
#define INLVLA5                       3907
#define INLVLA6                       3908
#define INLVLA7                       3909
#define IOCAP                         3910
#define IOCAP0                        3911
#define IOCAP1                        3912
#define IOCAP2                        3913
#define IOCAP3                        3914
#define IOCAP4                        3915
#define IOCAP5                        3916
#define IOCAP6                        3917
#define IOCAP7                        3918
#define IOCAN                         3919
#define IOCAN0                        3920
#define IOCAN1                        3921
#define IOCAN2                        3922
#define IOCAN3                        3923
#define IOCAN4                        3924
#define IOCAN5                        3925
#define IOCAN6                        3926
#define IOCAN7                        3927
#define IOCAF                         3928
#define IOCAF0                        3929
#define IOCAF1                        3930
#define IOCAF2                        3931
#define IOCAF3                        3932
#define IOCAF4                        3933
#define IOCAF5                        3934
#define IOCAF6                        3935
#define IOCAF7                        3936
#define CCDNA                         3937
#define CCDNA0                        3938
#define CCDNA1                        3939
#define CCDNA2                        3940
#define CCDNA3                        3941
#define CCDNA4                        3942
#define CCDNA5                        3943
#define CCDNA6                        3944
#define CCDNA7                        3945
#define CCDPA                         3946
#define CCDPA0                        3947
#define CCDPA1                        3948
#define CCDPA2                        3949
#define CCDPA3                        3950
#define CCDPA4                        3951
#define CCDPA5                        3952
#define CCDPA6                        3953
#define CCDPA7                        3954
#define ANSELB                        3955
#define ANSB0                         3956
#define ANSB1                         3957
#define ANSB2                         3958
#define ANSB3                         3959
#define ANSB4                         3960
#define ANSB5                         3961
#define ANSB6                         3962
#define ANSB7                         3963
#define WPUB                          3964
#define WPUB0                         3965
#define WPUB1                         3966
#define WPUB2                         3967
#define WPUB3                         3968
#define WPUB4                         3969
#define WPUB5                         3970
#define WPUB6                         3971
#define WPUB7                         3972
#define ODCONB                        3973
#define ODCB0                         3974
#define ODCB1                         3975
#define ODCB2                         3976
#define ODCB3                         3977
#define ODCB4                         3978
#define ODCB5                         3979
#define ODCB6                         3980
#define ODCB7                         3981
#define SLRCONB                       3982
#define SLRB0                         3983
#define SLRB1                         3984
#define SLRB2                         3985
#define SLRB3                         3986
#define SLRB4                         3987
#define SLRB5                         3988
#define SLRB6                         3989
#define SLRB7                         3990
#define INLVLB                        3991
#define INLVLB0                       3992
#define INLVLB1                       3993
#define INLVLB2                       3994
#define INLVLB3                       3995
#define INLVLB4                       3996
#define INLVLB5                       3997
#define INLVLB6                       3998
#define INLVLB7                       3999
#define IOCBP                         4000
#define IOCBP0                        4001
#define IOCBP1                        4002
#define IOCBP2                        4003
#define IOCBP3                        4004
#define IOCBP4                        4005
#define IOCBP5                        4006
#define IOCBP6                        4007
#define IOCBP7                        4008
#define IOCBN                         4009
#define IOCBN0                        4010
#define IOCBN1                        4011
#define IOCBN2                        4012
#define IOCBN3                        4013
#define IOCBN4                        4014
#define IOCBN5                        4015
#define IOCBN6                        4016
#define IOCBN7                        4017
#define IOCBF                         4018
#define IOCBF0                        4019
#define IOCBF1                        4020
#define IOCBF2                        4021
#define IOCBF3                        4022
#define IOCBF4                        4023
#define IOCBF5                        4024
#define IOCBF6                        4025
#define IOCBF7                        4026
#define CCDNB                         4027
#define CCDNB0                        4028
#define CCDNB1                        4029
#define CCDNB2                        4030
#define CCDNB3                        4031
#define CCDNB4                        4032
#define CCDNB5                        4033
#define CCDNB6                        4034
#define CCDNB7                        4035
#define CCDPB                         4036
#define CCDPB0                        4037
#define CCDPB1                        4038
#define CCDPB2                        4039
#define CCDPB3                        4040
#define CCDPB4                        4041
#define CCDPB5                        4042
#define CCDPB6                        4043
#define CCDPB7                        4044
#define ANSELC                        4045
#define ANSC0                         4046
#define ANSC1                         4047
#define ANSC2                         4048
#define ANSC3                         4049
#define ANSC4                         4050
#define ANSC5                         4051
#define ANSC6                         4052
#define ANSC7                         4053
#define WPUC                          4054
#define WPUC0                         4055
#define WPUC1                         4056
#define WPUC2                         4057
#define WPUC3                         4058
#define WPUC4                         4059
#define WPUC5                         4060
#define WPUC6                         4061
#define WPUC7                         4062
#define ODCONC                        4063
#define ODCC0                         4064
#define ODCC1                         4065
#define ODCC2                         4066
#define ODCC3                         4067
#define ODCC4                         4068
#define ODCC5                         4069
#define ODCC6                         4070
#define ODCC7                         4071
#define SLRCONC                       4072
#define SLRC0                         4073
#define SLRC1                         4074
#define SLRC2                         4075
#define SLRC3                         4076
#define SLRC4                         4077
#define SLRC5                         4078
#define SLRC6                         4079
#define SLRC7                         4080
#define INLVLC                        4081
#define INLVLC0                       4082
#define INLVLC1                       4083
#define INLVLC2                       4084
#define INLVLC3                       4085
#define INLVLC4                       4086
#define INLVLC5                       4087
#define INLVLC6                       4088
#define INLVLC7                       4089
#define IOCCP                         4090
#define IOCCP0                        4091
#define IOCCP1                        4092
#define IOCCP2                        4093
#define IOCCP3                        4094
#define IOCCP4                        4095
#define IOCCP5                        4096
#define IOCCP6                        4097
#define IOCCP7                        4098
#define IOCCN                         4099
#define IOCCN0                        4100
#define IOCCN1                        4101
#define IOCCN2                        4102
#define IOCCN3                        4103
#define IOCCN4                        4104
#define IOCCN5                        4105
#define IOCCN6                        4106
#define IOCCN7                        4107
#define IOCCF                         4108
#define IOCCF0                        4109
#define IOCCF1                        4110
#define IOCCF2                        4111
#define IOCCF3                        4112
#define IOCCF4                        4113
#define IOCCF5                        4114
#define IOCCF6                        4115
#define IOCCF7                        4116
#define CCDNC                         4117
#define CCDNC0                        4118
#define CCDNC1                        4119
#define CCDNC2                        4120
#define CCDNC3                        4121
#define CCDNC4                        4122
#define CCDNC5                        4123
#define CCDNC6                        4124
#define CCDNC7                        4125
#define CCDPC                         4126
#define CCDPC0                        4127
#define CCDPC1                        4128
#define CCDPC2                        4129
#define CCDPC3                        4130
#define CCDPC4                        4131
#define CCDPC5                        4132
#define CCDPC6                        4133
#define CCDPC7                        4134
#define WPUE                          4135
#define WPUE0                         4136
#define WPUE1                         4137
#define WPUE2                         4138
#define INLVLE                        4139
#define INLVLE0                       4140
#define INLVLE1                       4141
#define INLVLE2                       4142
#define IOCEP                         4143
#define IOCEP3                        4144
#define IOCEN                         4145
#define IOCEN3                        4146
#define IOCEF                         4147
#define IOCEF3                        4148
#define STATUS_SHAD                   4149
#define C_SHAD                        4150
#define DC_SHAD                       4151
#define Z_SHAD                        4152
#define WREG_SHAD                     4153
#define BSR_SHAD                      4154
#define PCLATH_SHAD                   4155
#define FSR0L_SHAD                    4156
#define FSR0H_SHAD                    4157
#define FSR1L_SHAD                    4158
#define FSR1H_SHAD                    4159
#define STKPTR                        4160
#define TOSL                          4161
#define TOSH                          4162

#endif // _PIC16F18857_H_
